[
  {
    "title": "n8n Supply Chain Attack Abuses Community Nodes to Steal OAuth Tokens",
    "link": "https://thehackernews.com/2026/01/n8n-supply-chain-attack-abuses.html",
    "published": "Mon, 12 Jan 2026 22:09:00 +0530",
    "summary": "Threat actors have been observed uploading a set of eight packages on the npm registry that masqueraded as integrations targeting the n8n workflow automation platform to steal developers' OAuth credentials.\nOne such package, named \"n8n-nodes-hfgjf-irtuinvcm-lasdqewriit,\" mimics a Google Ads integration, and prompts users to link their advertising account in a seemingly legitimate form and then"
  },
  {
    "title": "⚡ Weekly Recap: AI Automation Exploits, Telecom Espionage, Prompt Poaching & More",
    "link": "https://thehackernews.com/2026/01/weekly-recap-ai-automation-exploits.html",
    "published": "Mon, 12 Jan 2026 19:11:00 +0530",
    "summary": "This week made one thing clear: small oversights can spiral fast. Tools meant to save time and reduce friction turned into easy entry points once basic safeguards were ignored. Attackers didn’t need novel tricks. They used what was already exposed and moved in without resistance.\nScale amplified the damage. A single weak configuration rippled out to millions. A repeatable flaw worked again and"
  },
  {
    "title": "GoBruteforcer Botnet Targets Crypto Project Databases by Exploiting Weak Credentials",
    "link": "https://thehackernews.com/2026/01/gobruteforcer-botnet-targets-crypto.html",
    "published": "Mon, 12 Jan 2026 16:18:00 +0530",
    "summary": "A new wave of GoBruteforcer attacks has targeted databases of cryptocurrency and blockchain projects to co-opt them into a botnet that's capable of brute-forcing user passwords for services such as FTP, MySQL, PostgreSQL, and phpMyAdmin on Linux servers.\n\"The current wave of campaigns is driven by two factors: the mass reuse of AI-generated server deployment examples that propagate common"
  },
  {
    "title": "Anthropic Launches Claude AI for Healthcare with Secure Health Record Access",
    "link": "https://thehackernews.com/2026/01/anthropic-launches-claude-ai-for.html",
    "published": "Mon, 12 Jan 2026 14:07:00 +0530",
    "summary": "Anthropic has become the latest Artificial intelligence (AI) company to announce a new suite of features that allows users of its Claude platform to better understand their health information.\nUnder an initiative called Claude for Healthcare, the company said U.S. subscribers of Claude Pro and Max plans can opt to give Claude secure access to their lab results and health records by connecting to"
  },
  {
    "title": "Researchers Uncover Service Providers Fueling Industrial-Scale Pig Butchering Fraud",
    "link": "https://thehackernews.com/2026/01/researchers-uncover-service-providers.html",
    "published": "Mon, 12 Jan 2026 13:04:00 +0530",
    "summary": "Cybersecurity researchers have shed light on two service providers that supply online criminal networks with the necessary tools and infrastructure to fuel the pig butchering-as-a-service (PBaaS) economy.\nAt least since 2016, Chinese-speaking criminal groups have erected industrial-scale scam centers across Southeast Asia, creating special economic zones that are devoted to fraudulent investment"
  },
  {
    "title": "MuddyWater Launches RustyWater RAT via Spear-Phishing Across Middle East Sectors",
    "link": "https://thehackernews.com/2026/01/muddywater-launches-rustywater-rat-via.html",
    "published": "Sat, 10 Jan 2026 16:05:00 +0530",
    "summary": "The Iranian threat actor known as MuddyWater has been attributed to a spear-phishing campaign targeting diplomatic, maritime, financial, and telecom entities in the Middle East with a Rust-based implant codenamed RustyWater.\n\"The campaign uses icon spoofing and malicious Word documents to deliver Rust based implants capable of asynchronous C2, anti-analysis, registry persistence, and modular"
  },
  {
    "title": "Europol Arrests 34 Black Axe Members in Spain Over €5.9M Fraud and Organized Crime",
    "link": "https://thehackernews.com/2026/01/europol-arrests-34-black-axe-members-in.html",
    "published": "Sat, 10 Jan 2026 14:29:00 +0530",
    "summary": "Europol on Friday announced the arrest of 34 individuals in Spain who are alleged to be part of an international criminal organization called Black Axe.\nAs part of an operation conducted by the Spanish National Police, in coordination with the Bavarian State Criminal Police Office and Europol, 28 arrests were made in Seville, along with three others in Madrid, two in Málaga, and one in Barcelona"
  },
  {
    "title": "China-Linked Hackers Exploit VMware ESXi Zero-Days to Escape Virtual Machines",
    "link": "https://thehackernews.com/2026/01/chinese-linked-hackers-exploit-vmware.html",
    "published": "Fri, 09 Jan 2026 23:13:00 +0530",
    "summary": "Chinese-speaking threat actors are suspected to have leveraged a compromised SonicWall VPN appliance as an initial access vector to deploy a VMware ESXi exploit that may have been developed as far back as February 2024.\nCybersecurity firm Huntress, which observed the activity in December 2025 and stopped it before it could progress to the final stage, said it may have resulted in a ransomware"
  },
  {
    "title": "Russian APT28 Runs Credential-Stealing Campaign Targeting Energy and Policy Organizations",
    "link": "https://thehackernews.com/2026/01/russian-apt28-runs-credential-stealing.html",
    "published": "Fri, 09 Jan 2026 20:58:00 +0530",
    "summary": "Russian state-sponsored threat actors have been linked to a fresh set of credential harvesting attacks targeting individuals associated with a Turkish energy and nuclear research agency, as well as staff affiliated with a European think tank and organizations in North Macedonia and Uzbekistan.\nThe activity has been attributed to APT28 (aka BlueDelta), which was tied to a \"sustained\""
  },
  {
    "title": "Cybersecurity Predictions 2026: The Hype We Can Ignore (And the Risks We Can't)",
    "link": "https://thehackernews.com/2026/01/cybersecurity-predictions-2026-hype-we.html",
    "published": "Fri, 09 Jan 2026 16:39:00 +0530",
    "summary": "As organizations plan for 2026, cybersecurity predictions are everywhere. Yet many strategies are still shaped by headlines and speculation rather than evidence. The real challenge isn’t a lack of forecasts—it’s identifying which predictions reflect real, emerging risks and which can safely be ignored.\nAn upcoming webinar hosted by Bitdefender aims to cut through the noise with a data-driven"
  }
]