[
  {
    "title": "Researchers Find 175,000 Publicly Exposed Ollama AI Servers Across 130 Countries",
    "link": "https://thehackernews.com/2026/01/researchers-find-175000-publicly.html",
    "published": "Fri, 30 Jan 2026 00:07:00 +0530",
    "summary": "A new joint investigation by SentinelOne SentinelLABS, and Censys has revealed that the open-source artificial intelligence (AI) deployment has created a vast \"unmanaged, publicly accessible layer of AI compute infrastructure\" that spans 175,000 unique Ollama hosts across 130 countries.\nThese systems, which span both cloud and residential networks across the world, operate outside the"
  },
  {
    "title": "ThreatsDay Bulletin: New RCEs, Darknet Busts, Kernel Bugs & 25+ More Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-new-rces-darknet.html",
    "published": "Thu, 29 Jan 2026 18:31:00 +0530",
    "summary": "This week’s updates show how small changes can create real problems. Not loud incidents, but quiet shifts that are easy to miss until they add up. The kind that affects systems people rely on every day.\nMany of the stories point to the same trend: familiar tools being used in unexpected ways. Security controls are being worked on. Trusted platforms turning into weak spots. What looks routine on"
  },
  {
    "title": "Survey of 100+ Energy Systems Reveals Critical OT Cybersecurity Gaps",
    "link": "https://thehackernews.com/2026/01/survey-of-100-energy-systems-reveals.html",
    "published": "Thu, 29 Jan 2026 17:25:00 +0530",
    "summary": "A study by OMICRON has revealed widespread cybersecurity gaps in the operational technology (OT) networks of substations, power plants, and control centers worldwide. Drawing on data from more than 100 installations, the analysis highlights recurring technical, organizational, and functional issues that leave critical energy infrastructure vulnerable to cyber threats.\nThe findings are based on"
  },
  {
    "title": "3 Decisions CISOs Need to Make to Prevent Downtime Risk in 2026",
    "link": "https://thehackernews.com/2026/01/3-decisions-cisos-need-to-make-to.html",
    "published": "Thu, 29 Jan 2026 16:00:00 +0530",
    "summary": "Beyond the direct impact of cyberattacks, enterprises suffer from a secondary but potentially even more costly risk: operational downtime, any amount of which translates into very real damage. That’s why for CISOs, it’s key to prioritize decisions that reduce dwell time and protect their company from risk.&nbsp;\nThree strategic steps you can take this year for better results:\n1. Focus on today's"
  },
  {
    "title": "SolarWinds Fixes Four Critical Web Help Desk Flaws With Unauthenticated RCE and Auth Bypass",
    "link": "https://thehackernews.com/2026/01/solarwinds-fixes-four-critical-web-help.html",
    "published": "Thu, 29 Jan 2026 14:30:00 +0530",
    "summary": "SolarWinds has released security updates to address multiple security vulnerabilities impacting SolarWinds Web Help Desk, including four critical vulnerabilities that could result in authentication bypass and remote code execution (RCE).\nThe list of vulnerabilities is as follows -\n\nCVE-2025-40536 (CVSS score: 8.1) - A security control bypass vulnerability that could allow an unauthenticated"
  },
  {
    "title": "Google Disrupts IPIDEA — One of the World’s Largest Residential Proxy Networks",
    "link": "https://thehackernews.com/2026/01/google-disrupts-ipidea-one-of-worlds.html",
    "published": "Thu, 29 Jan 2026 12:46:00 +0530",
    "summary": "Google on Wednesday announced that it worked together with other partners to disrupt IPIDEA, which it described as one of the largest residential proxy networks in the world.\nTo that end, the company said it took legal action to take down dozens of domains used to control devices and proxy traffic through them. As of writing, IPIDEA's website (\"www.ipidea.io\") is no longer accessible. It"
  },
  {
    "title": "Fake Moltbot AI Coding Assistant on VS Code Marketplace Drops Malware",
    "link": "https://thehackernews.com/2026/01/fake-moltbot-ai-coding-assistant-on-vs.html",
    "published": "Wed, 28 Jan 2026 23:16:00 +0530",
    "summary": "Cybersecurity researchers have flagged a new malicious Microsoft Visual Studio Code (VS Code) extension for Moltbot (formerly Clawdbot) on the official Extension Marketplace that claims to be a free artificial intelligence (AI) coding assistant, but stealthily drops a malicious payload on compromised hosts.\nThe extension, named \"ClawdBot Agent - AI Coding Assistant\" (\"clawdbot.clawdbot-agent\")"
  },
  {
    "title": "Russian ELECTRUM Tied to December 2025 Cyber Attack on Polish Power Grid",
    "link": "https://thehackernews.com/2026/01/russian-electrum-tied-to-december-2025.html",
    "published": "Wed, 28 Jan 2026 21:36:00 +0530",
    "summary": "The \"coordinated\" cyber attack targeting multiple sites across the Polish power grid has been attributed with medium confidence to a Russian state-sponsored hacking crew known as ELECTRUM.\nOperational technology (OT) cybersecurity company Dragos, in a new intelligence brief published Tuesday, described the late December 2025 activity as the first major cyber attack targeting distributed energy"
  },
  {
    "title": "Two High-Severity n8n Flaws Allow Authenticated Remote Code Execution",
    "link": "https://thehackernews.com/2026/01/two-high-severity-n8n-flaws-allow.html",
    "published": "Wed, 28 Jan 2026 18:13:00 +0530",
    "summary": "Cybersecurity researchers have disclosed two new security flaws in the n8n workflow automation platform, including a crucial vulnerability that could result in remote code execution.\nThe weaknesses, discovered by the JFrog Security Research team, are listed below -\n\nCVE-2026-1470 (CVSS score: 9.9) - An eval injection vulnerability that could allow an authenticated user to bypass the Expression"
  },
  {
    "title": "From Triage to Threat Hunts: How AI Accelerates SecOps",
    "link": "https://thehackernews.com/2026/01/from-triage-to-threat-hunts-how-ai.html",
    "published": "Wed, 28 Jan 2026 17:25:00 +0530",
    "summary": "If you work in security operations, the concept of the AI SOC agent is likely familiar. Early narratives promised total autonomy. Vendors seized on the idea of the \"Autonomous SOC\" and suggested a future where algorithms replaced analysts.\nThat future has not arrived. We have not seen mass layoffs or empty security operations centers. We have instead seen the emergence of a practical reality."
  }
]