[
  {
    "title": "Researchers Null-Route Over 550 Kimwolf and Aisuru Botnet Command Servers",
    "link": "https://thehackernews.com/2026/01/kimwolf-botnet-infected-over-2-million.html",
    "published": "Thu, 15 Jan 2026 00:33:00 +0530",
    "summary": "The Black Lotus Labs team at Lumen Technologies said it null-routed traffic to more than 550 command-and-control (C2) nodes associated with the AISURU/Kimwolf botnet since early October 2025.\nAISURU and its Android counterpart, Kimwolf, have emerged as some of the biggest botnets in recent times, capable of directing enslaved devices to participate in distributed denial-of-service (DDoS)"
  },
  {
    "title": "AI Agents Are Becoming Privilege Escalation Paths",
    "link": "https://thehackernews.com/2026/01/ai-agents-are-becoming-privilege.html",
    "published": "Wed, 14 Jan 2026 20:37:00 +0530",
    "summary": "AI agents have quickly moved from experimental tools to core components of daily workflows across security, engineering, IT, and operations. What began as individual productivity aids, like personal code assistants, chatbots, and copilots, has evolved into shared, organization-wide agents embedded in critical processes. These agents can orchestrate workflows across multiple systems, for example:"
  },
  {
    "title": "Hackers Exploit c-ares DLL Side-Loading to Bypass Security and Deploy Malware",
    "link": "https://thehackernews.com/2026/01/hackers-exploit-c-ares-dll-side-loading.html",
    "published": "Wed, 14 Jan 2026 19:48:00 +0530",
    "summary": "Security experts have disclosed details of an active malware campaign that's exploiting a DLL side-loading vulnerability in a legitimate binary associated with the open-source c-ares library to bypass security controls and deliver a wide range of commodity trojans and stealers.\n\"Attackers achieve evasion by pairing a malicious libcares-2.dll with any signed version of the legitimate ahost.exe ("
  },
  {
    "title": "Fortinet Fixes Critical FortiSIEM Flaw Allowing Unauthenticated Remote Code Execution",
    "link": "https://thehackernews.com/2026/01/fortinet-fixes-critical-fortisiem-flaw.html",
    "published": "Wed, 14 Jan 2026 17:23:00 +0530",
    "summary": "Fortinet has released updates to fix a critical security flaw impacting FortiSIEM that could allow an unauthenticated attacker to achieve code execution on susceptible instances.\nThe operating system (OS) injection vulnerability, tracked as CVE-2025-64155, is rated 9.4 out of 10.0 on the CVSS scoring system.\n\"An improper neutralization of special elements used in an OS command ('OS command"
  },
  {
    "title": "New Research: 64% of 3rd-Party Applications Access Sensitive Data Without Justification",
    "link": "https://thehackernews.com/2026/01/new-research-64-of-3rd-party.html",
    "published": "Wed, 14 Jan 2026 16:30:00 +0530",
    "summary": "Research analyzing 4,700 leading websites reveals that 64% of third-party applications now access sensitive data without business justification, up from 51% in 2024.&nbsp;\nGovernment sector malicious activity spiked from 2% to 12.9%, while 1 in 7 Education sites show active compromise.\nSpecific offenders: Google Tag Manager (8% of violations), Shopify (5%), Facebook Pixel (4%).\n\nDownload the"
  },
  {
    "title": "Microsoft Fixes 114 Windows Flaws in January 2026 Patch, One Actively Exploited",
    "link": "https://thehackernews.com/2026/01/microsoft-fixes-114-windows-flaws-in.html",
    "published": "Wed, 14 Jan 2026 15:08:00 +0530",
    "summary": "Microsoft on Tuesday rolled out its first security update for 2026, addressing 114 security flaws, including one vulnerability that it said has been actively exploited in the wild.\nOf the 114 flaws, eight are rated Critical, and 106 are rated Important in severity. As many as 58 vulnerabilities have been classified as privilege escalation, followed by 22 information disclosure, 21 remote code"
  },
  {
    "title": "Critical Node.js Vulnerability Can Cause Server Crashes via async_hooks Stack Overflow",
    "link": "https://thehackernews.com/2026/01/critical-nodejs-vulnerability-can-cause.html",
    "published": "Wed, 14 Jan 2026 12:35:00 +0530",
    "summary": "Node.js has released updates to fix what it described as a critical security issue impacting \"virtually every production Node.js app\" that, if successfully exploited, could trigger a denial-of-service (DoS) condition.\n\"Node.js/V8 makes a best-effort attempt to recover from stack space exhaustion with a catchable error, which frameworks have come to rely on for service availability,\" Node.js's"
  },
  {
    "title": "PLUGGYAPE Malware Uses Signal and WhatsApp to Target Ukrainian Defense Forces",
    "link": "https://thehackernews.com/2026/01/pluggyape-malware-uses-signal-and.html",
    "published": "Wed, 14 Jan 2026 11:18:00 +0530",
    "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has disclosed details of new cyber attacks targeting its defense forces with malware known as PLUGGYAPE between October and December 2025.\nThe activity has been attributed with medium confidence to a Russian hacking group tracked as Void Blizzard (aka Laundry Bear or UAC-0190). The threat actor is believed to be active since at least"
  },
  {
    "title": "Long-Running Web Skimming Campaign Steals Credit Cards From Online Checkout Pages",
    "link": "https://thehackernews.com/2026/01/long-running-web-skimming-campaign.html",
    "published": "Tue, 13 Jan 2026 23:00:00 +0530",
    "summary": "Cybersecurity researchers have discovered a major web skimming campaign that has been active since January 2022, targeting several major payment networks like American Express, Diners Club, Discover, JCB Co., Ltd., Mastercard, and UnionPay.\n\"Enterprise organizations that are clients of these payment providers are the most likely to be impacted,\" Silent Push said in a report published today."
  },
  {
    "title": "Malicious Chrome Extension Steals MEXC API Keys by Masquerading as Trading Tool",
    "link": "https://thehackernews.com/2026/01/malicious-chrome-extension-steals-mexc.html",
    "published": "Tue, 13 Jan 2026 22:52:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a malicious Google Chrome extension that's capable of stealing API keys associated with MEXC, a centralized cryptocurrency exchange (CEX) available in over 170 countries, while masquerading as a tool to automate trading on the platform.\nThe extension, named MEXC API Automator (ID: pppdfgkfdemgfknfnhpkibbkabhghhfh), has 29 downloads and is still"
  }
]