[
  {
    "title": "Google Sues China-Based Hackers Behind $1 Billion Lighthouse Phishing Platform",
    "link": "https://thehackernews.com/2025/11/google-sues-china-based-hackers-behind.html",
    "published": "Wed, 12 Nov 2025 21:18:00 +0530",
    "summary": "Google has filed a civil lawsuit in the U.S. District Court for the Southern District of New York (SDNY) against China-based hackers who are behind a massive Phishing-as-a-Service (PhaaS) platform called Lighthouse that has ensnared over 1 million users across 120 countries.\nThe PhaaS kit is used to conduct large-scale SMS phishing attacks that exploit trusted brands like E-ZPass and USPS to"
  },
  {
    "title": "Amazon Uncovers Attacks Exploited Cisco ISE and Citrix NetScaler as Zero-Day Flaws",
    "link": "https://thehackernews.com/2025/11/amazon-uncovers-attacks-exploited-cisco.html",
    "published": "Wed, 12 Nov 2025 19:30:00 +0530",
    "summary": "Amazon's threat intelligence team on Wednesday disclosed that it observed an advanced threat actor exploiting two then-zero-day security flaws in Cisco Identity Service Engine (ISE) and Citrix NetScaler ADC products as part of attacks designed to deliver custom malware.\n\"This discovery highlights the trend of threat actors focusing on critical identity and network access control infrastructure –"
  },
  {
    "title": "[Webinar] Learn How Leading Security Teams Reduce Attack Surface Exposure with DASR",
    "link": "https://thehackernews.com/2025/11/webinar-learn-how-leading-security.html",
    "published": "Wed, 12 Nov 2025 17:25:00 +0530",
    "summary": "Every day, security teams face the same problem—too many risks, too many alerts, and not enough time. You fix one issue, and three more show up. It feels like you’re always one step behind.\nBut what if there was a smarter way to stay ahead—without adding more work or stress?\nJoin The Hacker News and Bitdefender for a free cybersecurity webinar to learn about a new approach called Dynamic Attack"
  },
  {
    "title": "Active Directory Under Siege: Why Critical Infrastructure Needs Stronger Security",
    "link": "https://thehackernews.com/2025/11/active-directory-under-siege-why.html",
    "published": "Wed, 12 Nov 2025 16:37:00 +0530",
    "summary": "Active Directory remains the authentication backbone for&nbsp;over 90% of Fortune 1000 companies. AD's importance has grown as companies adopt hybrid and cloud infrastructure, but so has its complexity. Every application, user, and device traces back to AD for authentication and authorization, making it the ultimate target. For attackers, it represents the holy grail: compromise Active"
  },
  {
    "title": "Microsoft Fixes 63 Security Flaws, Including a Windows Kernel Zero-Day Under Active Attack",
    "link": "https://thehackernews.com/2025/11/microsoft-fixes-63-security-flaws.html",
    "published": "Wed, 12 Nov 2025 15:51:00 +0530",
    "summary": "Microsoft on Tuesday released patches for 63 new security vulnerabilities identified in its software, including one that has come under active exploitation in the wild.\nOf the 63 flaws, four are rated Critical and 59 are rated Important in severity. Twenty-nine of these vulnerabilities are related to privilege escalation, followed by 16 remote code execution, 11 information disclosure, three"
  },
  {
    "title": "Google Launches 'Private AI Compute' — Secure AI Processing with On-Device-Level Privacy",
    "link": "https://thehackernews.com/2025/11/google-launches-private-ai-compute.html",
    "published": "Wed, 12 Nov 2025 14:05:00 +0530",
    "summary": "Google on Tuesday unveiled a new privacy-enhancing technology called Private AI Compute to process artificial intelligence (AI) queries in a secure platform in the cloud.\nThe company said it has built Private AI Compute to \"unlock the full speed and power of Gemini cloud models for AI experiences, while ensuring your personal data stays private to you and is not accessible to anyone else, not"
  },
  {
    "title": "WhatsApp Malware 'Maverick' Hijacks Browser Sessions to Target Brazil's Biggest Banks",
    "link": "https://thehackernews.com/2025/11/whatsapp-malware-maverick-hijacks.html",
    "published": "Wed, 12 Nov 2025 00:07:00 +0530",
    "summary": "Threat hunters have uncovered similarities between a banking malware called Coyote and a newly disclosed malicious program dubbed Maverick that has been propagated via WhatsApp.\nAccording to a report from CyberProof, both malware strains are written in .NET, target Brazilian users and banks, and feature identical functionality to decrypt, targeting banking URLs and monitor banking applications."
  },
  {
    "title": "GootLoader Is Back, Using a New Font Trick to Hide Malware on WordPress Sites",
    "link": "https://thehackernews.com/2025/11/gootloader-is-back-using-new-font-trick.html",
    "published": "Tue, 11 Nov 2025 21:14:00 +0530",
    "summary": "The malware known as GootLoader has resurfaced yet again after a brief spike in activity earlier this March, according to new findings from Huntress.\nThe cybersecurity company said it observed three GootLoader infections since October 27, 2025, out of which two resulted in hands-on keyboard intrusions with domain controller compromise taking place within 17 hours of initial infection.\n\""
  },
  {
    "title": "CISO's Expert Guide To AI Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/11/cisos-expert-guide-to-ai-supply-chain.html",
    "published": "Tue, 11 Nov 2025 17:28:00 +0530",
    "summary": "AI-enabled supply chain attacks jumped 156% last year. Discover why traditional defenses are failing and what CISOs must do now to protect their organizations.\nDownload the full CISO&rsquo;s expert guide to AI Supply chain attacks here.&nbsp;\nTL;DR\n\nAI-enabled supply chain attacks are exploding in scale and sophistication - Malicious package uploads to open-source repositories jumped 156% in"
  },
  {
    "title": "Npm Package Targeting GitHub-Owned Repositories Flagged as Red Team Exercise",
    "link": "https://thehackernews.com/2025/11/researchers-detect-malicious-npm.html",
    "published": "Tue, 11 Nov 2025 17:25:00 +0530",
    "summary": "Cybersecurity researchers have discovered a malicious npm package named \"@acitons/artifact\" that typosquats the legitimate \"@actions/artifact\" package with the intent to target GitHub-owned repositories.\n\"We think the intent was to have this script execute during a build of a GitHub-owned repository, exfiltrate the tokens available to the build environment, and then use those tokens to publish"
  }
]