[
  {
    "title": "Bloody Wolf Expands Java-based NetSupport RAT Attacks in Kyrgyzstan and Uzbekistan",
    "link": "https://thehackernews.com/2025/11/bloody-wolf-expands-java-based.html",
    "published": "Thu, 27 Nov 2025 23:43:00 +0530",
    "summary": "The threat actor known as Bloody Wolf has been attributed to a cyber attack campaign that has targeted Kyrgyzstan since at least June 2025 with the goal of delivering NetSupport RAT.\nAs of October 2025, the activity has expanded to also single out Uzbekistan, Group-IB researchers Amirbek Kurbanov and Volen Kayo said in a report published in collaboration with Ukuk, a state enterprise under the"
  },
  {
    "title": "Microsoft to Block Unauthorized Scripts in Entra ID Logins with 2026 CSP Update",
    "link": "https://thehackernews.com/2025/11/microsoft-to-block-unauthorized-scripts.html",
    "published": "Thu, 27 Nov 2025 21:07:00 +0530",
    "summary": "Microsoft has announced plans to improve the security of Entra ID authentication by blocking unauthorized script injection attacks starting a year from now.\nThe update to its Content Security Policy (CSP) aims to enhance the Entra ID sign-in experience at \"login.microsoftonline[.]com\" by only letting scripts from trusted Microsoft domains run.\n\"This update strengthens security and adds an extra"
  },
  {
    "title": "Webinar: Learn to Spot Risks and Patch Safely with Community-Maintained Tools",
    "link": "https://thehackernews.com/2025/11/webinar-learn-to-spot-risks-and-patch.html",
    "published": "Thu, 27 Nov 2025 20:29:00 +0530",
    "summary": "If you're using community tools like Chocolatey or Winget to keep systems updated, you're not alone. These platforms are fast, flexible, and easy to work with—making them favorites for IT teams. But there’s a catch...\nThe very tools that make your job easier might also be the reason your systems are at risk.\nThese tools are run by the community. That means anyone can add or update packages. Some"
  },
  {
    "title": "ThreatsDay Bulletin: AI Malware, Voice Bot Flaws, Crypto Laundering, IoT Attacks — and 20 More Stories",
    "link": "https://thehackernews.com/2025/11/threatsday-bulletin-ai-malware-voice.html",
    "published": "Thu, 27 Nov 2025 15:33:00 +0530",
    "summary": "Hackers have been busy again this week. From fake voice calls and AI-powered malware to huge money-laundering busts and new scams, there’s a lot happening in the cyber world.\nCriminals are getting creative — using smart tricks to steal data, sound real, and hide in plain sight. But they’re not the only ones moving fast. Governments and security teams are fighting back, shutting down fake"
  },
  {
    "title": "Gainsight Expands Impacted Customer List Following Salesforce Security Alert",
    "link": "https://thehackernews.com/2025/11/gainsight-expands-impacted-customer.html",
    "published": "Thu, 27 Nov 2025 12:33:00 +0530",
    "summary": "Gainsight has disclosed that the recent suspicious activity targeting its applications has affected more customers than previously thought.\nThe company said Salesforce initially provided a list of 3 impacted customers and that it has \"expanded to a larger list\" as of November 21, 2025. It did not reveal the exact number of customers who were impacted, but its CEO, Chuck Ganapathi, said \"we"
  },
  {
    "title": "Shai-Hulud v2 Spreads From npm to Maven, as Campaign Exposes Thousands of Secrets",
    "link": "https://thehackernews.com/2025/11/shai-hulud-v2-campaign-spreads-from-npm.html",
    "published": "Wed, 26 Nov 2025 23:38:00 +0530",
    "summary": "The second wave of the Shai-Hulud supply chain attack has spilled over to the Maven ecosystem after compromising more than 830 packages in the npm registry.\nThe Socket Research Team said it identified a Maven Central package named org.mvnpm:posthog-node:4.18.1 that embeds the same two components associated with Sha1-Hulud: the \"setup_bun.js\" loader and the main payload \"bun_environment.js.\" The"
  },
  {
    "title": "Qilin Ransomware Turns South Korean MSP Breach Into 28-Victim 'Korean Leaks' Data Heist",
    "link": "https://thehackernews.com/2025/11/qilin-ransomware-turns-south-korean-msp.html",
    "published": "Wed, 26 Nov 2025 20:01:00 +0530",
    "summary": "South Korea's financial sector has been targeted by what has been described as a sophisticated supply chain attack that led to the deployment of Qilin ransomware.\n\"This operation combined the capabilities of a major Ransomware-as-a-Service (RaaS) group, Qilin, with potential involvement from North Korean state-affiliated actors (Moonstone Sleet), leveraging Managed Service Provider (MSP)"
  },
  {
    "title": "When Your $2M Security Detection Fails: Can your SOC Save You?",
    "link": "https://thehackernews.com/2025/11/when-your-2m-security-detection-fails.html",
    "published": "Wed, 26 Nov 2025 17:25:00 +0530",
    "summary": "Enterprises today are expected to have at least 6-8 detection tools, as detection is considered a standard investment and the first line of defense. Yet security leaders struggle to justify dedicating resources further down the alert lifecycle to their superiors.\nAs a result, most organizations' security investments are asymmetrical, robust detection tools paired with an under-resourced SOC,"
  },
  {
    "title": "Chrome Extension Caught Injecting Hidden Solana Transfer Fees Into Raydium Swaps",
    "link": "https://thehackernews.com/2025/11/chrome-extension-caught-injecting.html",
    "published": "Wed, 26 Nov 2025 16:40:00 +0530",
    "summary": "Cybersecurity researchers have discovered a new malicious extension on the Chrome Web Store that's capable of injecting a stealthy Solana transfer into a swap transaction and transferring the funds to an attacker-controlled cryptocurrency wallet.\nThe extension, named Crypto Copilot, was first published by a user named \"sjclark76\" on May 7, 2024. The developer describes the browser add-on as"
  },
  {
    "title": "RomCom Uses SocGholish Fake Update Attacks to Deliver Mythic Agent Malware",
    "link": "https://thehackernews.com/2025/11/romcom-uses-socgholish-fake-update.html",
    "published": "Wed, 26 Nov 2025 13:58:00 +0530",
    "summary": "The threat actors behind a malware family known as RomCom targeted a U.S.-based civil engineering company via a JavaScript loader dubbed SocGholish to deliver the Mythic Agent.\n\"This is the first time that a RomCom payload has been observed being distributed by SocGholish,\" Arctic Wolf Labs researcher Jacob Faires said in a Tuesday report.\nThe activity has been attributed with medium-to-high"
  }
]