[
  {
    "title": "North Korean Hackers Turn JSON Services into Covert Malware Delivery Channels",
    "link": "https://thehackernews.com/2025/11/north-korean-hackers-turn-json-services.html",
    "published": "Fri, 14 Nov 2025 23:55:00 +0530",
    "summary": "The North Korean threat actors behind the Contagious Interview campaign have once again tweaked their tactics by using JSON storage services to stage malicious payloads.\n\"The threat actors have recently resorted to utilizing JSON storage services like JSON Keeper, JSONsilo, and npoint.io to host and deliver malware from trojanized code projects, with the lure,\" NVISO researchers Bart Parys, Stef"
  },
  {
    "title": "Researchers Find Serious AI Bugs Exposing Meta, Nvidia, and Microsoft Inference Frameworks",
    "link": "https://thehackernews.com/2025/11/researchers-find-serious-ai-bugs.html",
    "published": "Fri, 14 Nov 2025 20:50:00 +0530",
    "summary": "Cybersecurity researchers have uncovered critical remote code execution vulnerabilities impacting major artificial intelligence (AI) inference engines, including those from Meta, Nvidia, Microsoft, and open-source PyTorch projects such as vLLM and SGLang.\n\"These vulnerabilities all traced back to the same root cause: the overlooked unsafe use of ZeroMQ (ZMQ) and Python's pickle deserialization,\""
  },
  {
    "title": "Iranian Hackers Launch ‘SpearSpecter’ Spy Operation on Defense & Government Targets",
    "link": "https://thehackernews.com/2025/11/iranian-hackers-launch-spearspecter-spy.html",
    "published": "Fri, 14 Nov 2025 20:10:00 +0530",
    "summary": "The Iranian state-sponsored threat actor known as APT42 has been observed targeting individuals and organizations that are of interest to the Islamic Revolutionary Guard Corps (IRGC) as part of a new espionage-focused campaign.\nThe activity, detected in early September 2025 and assessed to be ongoing, has been codenamed&nbsp;SpearSpecter by the Israel National Digital Agency (INDA).\n\"The"
  },
  {
    "title": "Ransomware's Fragmentation Reaches a Breaking Point While LockBit Returns",
    "link": "https://thehackernews.com/2025/11/ransomwares-fragmentation-reaches.html",
    "published": "Fri, 14 Nov 2025 16:07:00 +0530",
    "summary": "Key Takeaways:\n\n85 active ransomware and extortion groups observed in Q3 2025, reflecting the most decentralized ransomware ecosystem to date.\n1,590 victims disclosed across 85 leak sites, showing high, sustained activity despite law-enforcement pressure.\n14 new ransomware brands launched this quarter, proving how quickly affiliates reconstitute after takedowns.\nLockBit’s reappearance with"
  },
  {
    "title": "Chinese Hackers Use Anthropic's AI to Launch Automated Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2025/11/chinese-hackers-use-anthropics-ai-to.html",
    "published": "Fri, 14 Nov 2025 15:23:00 +0530",
    "summary": "State-sponsored threat actors from China used artificial intelligence (AI) technology developed by Anthropic to orchestrate automated cyber attacks as part of a \"highly sophisticated espionage campaign\" in mid-September 2025.\n\"The attackers used AI's 'agentic' capabilities to an unprecedented degree – using AI not just as an advisor, but to execute the cyber attacks themselves,\" the AI upstart"
  },
  {
    "title": "Now-Patched Fortinet FortiWeb Flaw Exploited in Attacks to Create Admin Accounts",
    "link": "https://thehackernews.com/2025/11/fortinet-fortiweb-flaw-actively.html",
    "published": "Fri, 14 Nov 2025 14:30:00 +0530",
    "summary": "Cybersecurity researchers are sounding the alert about an authentication bypass vulnerability in Fortinet Fortiweb WAF that could allow an attacker to take over admin accounts and completely compromise a device.\n\"The watchTowr team is seeing active, indiscriminate in-the-wild exploitation of what appears to be a silently patched vulnerability in Fortinet's FortiWeb product,\" Benjamin Harris,"
  },
  {
    "title": "Russian Hackers Create 4,300 Fake Travel Sites to Steal Hotel Guests' Payment Data",
    "link": "https://thehackernews.com/2025/11/russian-hackers-create-4300-fake-travel.html",
    "published": "Fri, 14 Nov 2025 01:57:00 +0530",
    "summary": "A Russian-speaking threat behind an ongoing, mass phishing campaign has registered more than 4,300 domain names since the start of the year.\nThe activity, per Netcraft security researcher Andrew Brandt, is designed to target customers of the hospitality industry, specifically hotel guests who may have travel reservations with spam emails. The campaign is said to have begun in earnest around"
  },
  {
    "title": "Fake Chrome Extension “Safery” Steals Ethereum Wallet Seed Phrases Using Sui Blockchain",
    "link": "https://thehackernews.com/2025/11/fake-chrome-extension-safery-steals.html",
    "published": "Thu, 13 Nov 2025 18:34:00 +0530",
    "summary": "Cybersecurity researchers have uncovered a malicious Chrome extension that poses as a legitimate Ethereum wallet but harbors functionality to exfiltrate users' seed phrases.\nThe name of the extension is \"Safery: Ethereum Wallet,\" with the threat actor describing it as a \"secure wallet for managing Ethereum cryptocurrency with flexible settings.\" It was uploaded to the Chrome Web Store on"
  },
  {
    "title": "When Attacks Come Faster Than Patches: Why 2026 Will be the Year of Machine-Speed Security",
    "link": "https://thehackernews.com/2025/11/when-attacks-come-faster-than-patches.html",
    "published": "Thu, 13 Nov 2025 17:00:00 +0530",
    "summary": "The Race for Every New CVE\nBased on multiple 2025 industry reports: roughly 50 to 61 percent of newly disclosed vulnerabilities saw exploit code weaponized within 48 hours. Using the CISA Known Exploited Vulnerabilities Catalog as a reference, hundreds of software flaws are now confirmed as actively targeted within days of public disclosure. Each new announcement now triggers a global race"
  },
  {
    "title": "Operation Endgame Dismantles Rhadamanthys, Venom RAT, and Elysium Botnet in Global Crackdown",
    "link": "https://thehackernews.com/2025/11/operation-endgame-dismantles.html",
    "published": "Thu, 13 Nov 2025 16:46:00 +0530",
    "summary": "Malware families like Rhadamanthys Stealer, Venom RAT, and the Elysium botnet have been disrupted as part of a coordinated law enforcement operation led by Europol and Eurojust.\nThe activity, which is taking place between November 10 and 13, 2025, marks the latest phase of Operation Endgame, an ongoing operation designed to take down criminal infrastructures and combat ransomware enablers"
  }
]