[
  {
    "title": "ShadowRay 2.0 Exploits Unpatched Ray Flaw to Build Self-Spreading GPU Cryptomining Botnet",
    "link": "https://thehackernews.com/2025/11/shadowray-20-exploits-unpatched-ray.html",
    "published": "Thu, 20 Nov 2025 22:54:00 +0530",
    "summary": "Oligo Security has warned of ongoing attacks exploiting a two-year-old security flaw in the Ray open-source artificial intelligence (AI) framework to turn infected clusters with NVIDIA GPUs into a self-replicating cryptocurrency mining botnet.\nThe activity, codenamed ShadowRay 2.0, is an evolution of a prior wave that was observed between September 2023 and March 2024. The attack, at its core,"
  },
  {
    "title": "Tsundere Botnet Expands Using Game Lures and Ethereum-Based C2 on Windows",
    "link": "https://thehackernews.com/2025/11/tsundere-botnet-expands-using-game.html",
    "published": "Thu, 20 Nov 2025 22:27:00 +0530",
    "summary": "Cybersecurity researchers have warned of an actively expanding botnet dubbed Tsundere that's targeting Windows users.\nActive since mid-2025, the threat is designed to execute arbitrary JavaScript code retrieved from a command-and-control (C2) server, Kaspersky researcher Lisandro Ubiedo said in an analysis published today.\nThere are currently no details on how the botnet malware is propagated;"
  },
  {
    "title": "ThreatsDay Bulletin: 0-Days, LinkedIn Spies, Crypto Crimes, IoT Flaws and New Malware Waves",
    "link": "https://thehackernews.com/2025/11/threatsday-bulletin-0-days-linkedin.html",
    "published": "Thu, 20 Nov 2025 17:59:00 +0530",
    "summary": "This week has been crazy in the world of hacking and online security. From Thailand to London to the US, we've seen arrests, spies at work, and big power moves online. Hackers are getting caught. Spies are getting better at their jobs. Even simple things like browser add-ons and smart home gadgets are being used to attack people.\nEvery day, there's a new story that shows how quickly things are"
  },
  {
    "title": "CTM360 Exposes a Global WhatsApp Hijacking Campaign: HackOnChat",
    "link": "https://thehackernews.com/2025/11/ctm360-exposes-global-whatsapp.html",
    "published": "Thu, 20 Nov 2025 17:00:00 +0530",
    "summary": "CTM360 has identified a rapidly expanding WhatsApp account-hacking campaign targeting users worldwide via a network of deceptive authentication portals and impersonation pages. The campaign, internally dubbed HackOnChat, abuses WhatsApp’s familiar web interface, using social engineering tactics to trick users into compromising their accounts.\nInvestigators identified thousands of malicious URLs"
  },
  {
    "title": "New Sturnus Android Trojan Quietly Captures Encrypted Chats and Hijacks Devices",
    "link": "https://thehackernews.com/2025/11/new-sturnus-android-trojan-quietly.html",
    "published": "Thu, 20 Nov 2025 16:34:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new Android banking trojan called Sturnus that enables credential theft and full device takeover to conduct financial fraud.\n\"A key differentiator is its ability to bypass encrypted messaging,\" ThreatFabric said in a report shared with The Hacker News. \"By capturing content directly from the device screen after decryption, Sturnus can monitor"
  },
  {
    "title": "Iran-Linked Hackers Mapped Ship AIS Data Days Before Real-World Missile Strike Attempt",
    "link": "https://thehackernews.com/2025/11/iran-linked-hackers-mapped-ship-ais.html",
    "published": "Thu, 20 Nov 2025 13:05:00 +0530",
    "summary": "Threat actors with ties to Iran engaged in cyber warfare as part of efforts to facilitate and enhance physical, real-world attacks, a trend that Amazon has called cyber-enabled kinetic targeting.\nThe development is a sign that the lines between state-sponsored cyber attacks and kinetic warfare are increasingly blurring, necessitating the need for a new category of warfare, the tech giant's"
  },
  {
    "title": "TamperedChef Malware Spreads via Fake Software Installers in Ongoing Global Campaign",
    "link": "https://thehackernews.com/2025/11/tamperedchef-malware-spreads-via-fake.html",
    "published": "Thu, 20 Nov 2025 09:36:00 +0530",
    "summary": "Threat actors are leveraging bogus installers masquerading as popular software to trick users into installing malware as part of a global malvertising campaign dubbed TamperedChef.\nThe end goal of the attacks is to establish persistence and deliver JavaScript malware that facilitates remote access and control, per a new report from Acronis Threat Research Unit (TRU). The campaign, per the"
  },
  {
    "title": "Hackers Actively Exploiting 7-Zip Symbolic Link–Based RCE Vulnerability (CVE-2025-11001)",
    "link": "https://thehackernews.com/2025/11/hackers-actively-exploiting-7-zip.html",
    "published": "Wed, 19 Nov 2025 21:57:00 +0530",
    "summary": "A recently disclosed security flaw impacting 7-Zip has come under active exploitation in the wild, according to an advisory issued by the U.K. NHS England Digital on Tuesday.\nThe vulnerability in question is CVE-2025-11001 (CVSS score: 7.0), which allows remote attackers to execute arbitrary code. It has been addressed in 7-Zip version 25.00 released in July 2025.\n\"The specific flaw exists"
  },
  {
    "title": "Python-Based WhatsApp Worm Spreads Eternidade Stealer Across Brazilian Devices",
    "link": "https://thehackernews.com/2025/11/python-based-whatsapp-worm-spreads.html",
    "published": "Wed, 19 Nov 2025 21:05:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that leverages a combination of social engineering and WhatsApp hijacking to distribute a Delphi-based banking trojan named Eternidade Stealer as part of attacks targeting users in Brazil.\n\"It uses Internet Message Access Protocol (IMAP) to dynamically retrieve command-and-control (C2) addresses, allowing the threat actor to"
  },
  {
    "title": "WrtHug Exploits Six ASUS WRT Flaws to Hijack Tens of Thousands of EoL Routers Worldwide",
    "link": "https://thehackernews.com/2025/11/wrthug-exploits-six-asus-wrt-flaws-to.html",
    "published": "Wed, 19 Nov 2025 18:30:00 +0530",
    "summary": "A newly discovered campaign has compromised tens of thousands of outdated or end-of-life (EoL) ASUS routers worldwide, predominantly in Taiwan, the U.S., and Russia, to rope them into a massive network.\nThe router hijacking activity has been codenamed Operation WrtHug by SecurityScorecard's STRIKE team. Southeast Asia and European countries are some of the other regions where infections have"
  }
]