[
  {
    "title": "OpenAI Unveils Aardvark: GPT-5 Agent That Finds and Fixes Code Flaws Automatically",
    "link": "https://thehackernews.com/2025/10/openai-unveils-aardvark-gpt-5-agent.html",
    "published": "Fri, 31 Oct 2025 22:49:00 +0530",
    "summary": "OpenAI has announced the launch of an \"agentic security researcher\" that's powered by its GPT-5 large language model (LLM) and is programmed to emulate a human expert capable of scanning, understanding, and patching code.\nCalled Aardvark, the artificial intelligence (AI) company said the autonomous agent is designed to help developers and security teams flag and fix security vulnerabilities at"
  },
  {
    "title": "Nation-State Hackers Deploy New Airstalk Malware in Suspected Supply Chain Attack",
    "link": "https://thehackernews.com/2025/10/nation-state-hackers-deploy-new.html",
    "published": "Fri, 31 Oct 2025 21:38:00 +0530",
    "summary": "A suspected nation-state threat actor has been linked to the distribution of a new malware called Airstalk as part of a likely supply chain attack.\nPalo Alto Networks Unit 42 said it's tracking the cluster under the moniker CL-STA-1009, where \"CL\" stands for cluster and \"STA\" refers to state-backed motivation.\n\"Airstalk misuses the AirWatch API for mobile device management (MDM), which is now"
  },
  {
    "title": "China-Linked Hackers Exploit Windows Shortcut Flaw to Target European Diplomats",
    "link": "https://thehackernews.com/2025/10/china-linked-hackers-exploit-windows.html",
    "published": "Fri, 31 Oct 2025 19:27:00 +0530",
    "summary": "A China-affiliated threat actor known as UNC6384 has been linked to a fresh set of attacks exploiting an unpatched Windows shortcut vulnerability to target European diplomatic and government entities between September and October 2025.\nThe activity targeted diplomatic organizations in Hungary, Belgium, Italy, and the Netherlands, as well as government agencies in Serbia, Arctic Wolf said in a"
  },
  {
    "title": "China-Linked Tick Group Exploits Lanscope Zero-Day to Hijack Corporate Systems",
    "link": "https://thehackernews.com/2025/10/china-linked-tick-group-exploits.html",
    "published": "Fri, 31 Oct 2025 18:56:00 +0530",
    "summary": "The exploitation of a recently disclosed critical security flaw in Motex Lanscope Endpoint Manager has been attributed to a cyber espionage group known as Tick.\nThe vulnerability, tracked as CVE-2025-61932 (CVSS score: 9.3), allows remote attackers to execute arbitrary commands with SYSTEM privileges on on-premise versions of the program. JPCERT/CC, in an alert issued this month, said that it"
  },
  {
    "title": "The MSP Cybersecurity Readiness Guide: Turning Security into Growth",
    "link": "https://thehackernews.com/2025/10/the-msp-cybersecurity-readiness-guide.html",
    "published": "Fri, 31 Oct 2025 17:00:00 +0530",
    "summary": "MSPs are facing rising client expectations for strong cybersecurity and compliance outcomes, while threats grow more complex and regulatory demands evolve. Meanwhile, clients are increasingly seeking comprehensive protection without taking on the burden of managing security themselves.\nThis shift represents a major growth opportunity. By delivering advanced cybersecurity and compliance"
  },
  {
    "title": "CISA and NSA Issue Urgent Guidance to Secure WSUS and Microsoft Exchange Servers",
    "link": "https://thehackernews.com/2025/10/cisa-and-nsa-issue-urgent-guidance-to.html",
    "published": "Fri, 31 Oct 2025 14:16:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) and National Security Agency (NSA), along with international partners from Australia and Canada, have released guidance to harden on-premise Microsoft Exchange Server instances from potential exploitation.\n\"By restricting administrative access, implementing multi-factor authentication, enforcing strict transport security"
  },
  {
    "title": "Eclipse Foundation Revokes Leaked Open VSX Tokens Following Wiz Discovery",
    "link": "https://thehackernews.com/2025/10/eclipse-foundation-revokes-leaked-open.html",
    "published": "Fri, 31 Oct 2025 13:32:00 +0530",
    "summary": "Eclipse Foundation, which maintains the open-source Open VSX project, said it has taken steps to revoke a small number of tokens that were leaked within Visual Studio Code (VS Code) extensions published in the marketplace.\nThe action comes following a report from cloud security company Wiz earlier this month, which found several extensions from both Microsoft's VS Code Marketplace and Open VSX"
  },
  {
    "title": "CISA Flags VMware Zero-Day Exploited by China-Linked Hackers in Active Attacks",
    "link": "https://thehackernews.com/2025/10/cisa-flags-vmware-zero-day-exploited-by.html",
    "published": "Fri, 31 Oct 2025 12:39:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a high-severity security flaw impacting Broadcom VMware Tools and VMware Aria Operations to its Known Exploited Vulnerabilities (KEV) catalog, following reports of active exploitation in the wild.\nThe vulnerability in question is CVE-2025-41244 (CVSS score: 7.8), which could be exploited by an attacker to attain"
  },
  {
    "title": "A New Security Layer for macOS Takes Aim at Admin Errors Before Hackers Do",
    "link": "https://thehackernews.com/2025/10/a-new-security-layer-for-macos-takes.html",
    "published": "Fri, 31 Oct 2025 09:07:00 +0530",
    "summary": "A design firm is editing a new campaign video on a MacBook Pro. The creative director opens a collaboration app that quietly requests microphone and camera permissions. MacOS is supposed to flag that, but in this case, the checks are loose. The app gets access anyway.\nOn another Mac in the same office, file sharing is enabled through an old protocol called SMB version one. It’s fast and"
  },
  {
    "title": "Google's Built-In AI Defenses on Android Now Block 10 Billion Scam Messages a Month",
    "link": "https://thehackernews.com/2025/10/googles-built-in-ai-defenses-on-android.html",
    "published": "Thu, 30 Oct 2025 22:30:00 +0530",
    "summary": "Google on Thursday revealed that the scam defenses built into Android safeguard users around the world from more than 10 billion suspected malicious calls and messages every month.\nThe tech giant also said it has blocked over 100 million suspicious numbers from using Rich Communication Services (RCS), an evolution of the SMS protocol, thereby preventing scams before they could even be sent.\nIn"
  }
]