[
  {
    "title": "Iran-Linked DCHSpy Android Malware Masquerades as VPN Apps to Spy on Dissidents",
    "link": "https://thehackernews.com/2025/07/iran-linked-dchspy-android-malware.html",
    "published": "Mon, 21 Jul 2025 22:48:00 +0530",
    "summary": "Cybersecurity researchers have unearthed new Android spyware artifacts that are likely affiliated with the Iranian Ministry of Intelligence and Security (MOIS) and have been distributed to targets by masquerading as VPN apps and Starlink, a satellite internet connection service offered by SpaceX.\nMobile security vendor Lookout said it discovered four samples of a surveillanceware tool it tracks"
  },
  {
    "title": "China-Linked Hackers Launch Targeted Espionage Campaign on African IT Infrastructure",
    "link": "https://thehackernews.com/2025/07/china-linked-hackers-launch-targeted.html",
    "published": "Mon, 21 Jul 2025 21:57:00 +0530",
    "summary": "The China-linked cyber espionage group tracked as APT41 has been attributed to a new campaign targeting government IT services in the African region.\n\"The attackers used hardcoded names of internal services, IP addresses, and proxy servers embedded within their malware,\" Kaspersky researchers Denis Kulik and Daniil Pogorelov said. \"One of the C2s [command-and-control servers] was a captive"
  },
  {
    "title": "⚡ Weekly Recap: SharePoint 0-Day, Chrome Exploit, macOS Spyware, NVIDIA Toolkit RCE and More",
    "link": "https://thehackernews.com/2025/07/weekly-recap-sharepoint-0-day-chrome.html",
    "published": "Mon, 21 Jul 2025 17:08:00 +0530",
    "summary": "Even in well-secured environments, attackers are getting in—not with flashy exploits, but by quietly taking advantage of weak settings, outdated encryption, and trusted tools left unprotected.\nThese attacks don’t depend on zero-days. They work by staying unnoticed—slipping through the cracks in what we monitor and what we assume is safe. What once looked suspicious now blends in, thanks to"
  },
  {
    "title": "Assessing the Role of AI in Zero Trust",
    "link": "https://thehackernews.com/2025/07/assessing-role-of-ai-in-zero-trust.html",
    "published": "Mon, 21 Jul 2025 16:55:00 +0530",
    "summary": "By 2025, Zero Trust has evolved from a conceptual framework into an essential pillar of modern security. No longer merely theoretical, it’s now a requirement that organizations must adopt. A robust, defensible architecture built on Zero Trust principles does more than satisfy baseline regulatory mandates. It underpins cyber resilience, secures third-party partnerships, and ensures uninterrupted"
  },
  {
    "title": "PoisonSeed Hackers Bypass FIDO Keys Using QR Phishing and Cross-Device Sign-In Abuse",
    "link": "https://thehackernews.com/2025/07/poisonseed-hackers-bypass-fido-keys.html",
    "published": "Mon, 21 Jul 2025 11:43:00 +0530",
    "summary": "Cybersecurity researchers have disclosed a novel attack technique that allows threat actors to downgrade Fast IDentity Online (FIDO) key protections by deceiving users into approving authentication requests from spoofed company login portals.FIDO keys are hardware- or software-based authenticators designed to eliminate phishing by binding logins to specific domains using public-private key"
  },
  {
    "title": "Microsoft Releases Urgent Patch for SharePoint RCE Flaw Exploited in Ongoing Cyber Attacks",
    "link": "https://thehackernews.com/2025/07/microsoft-releases-urgent-patch-for.html",
    "published": "Mon, 21 Jul 2025 09:00:00 +0530",
    "summary": "Microsoft on Sunday released security patches for an actively exploited security flaw in SharePoint and also disclosed details of another vulnerability that it said has been addressed with \"more robust protections.\"\nThe tech giant acknowledged it's \"aware of active attacks targeting on-premises SharePoint Server customers by exploiting vulnerabilities partially addressed by the July Security"
  },
  {
    "title": "Hard-Coded Credentials Found in HPE Instant On Devices Allow Admin Access",
    "link": "https://thehackernews.com/2025/07/hard-coded-credentials-found-in-hpe.html",
    "published": "Mon, 21 Jul 2025 08:55:00 +0530",
    "summary": "Hewlett-Packard Enterprise (HPE) has released security updates to address a critical security flaw affecting Instant On Access Points that could allow an attacker to bypass authentication and gain administrative access to susceptible systems.\nThe vulnerability, tracked as CVE-2025-37103, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"Hard-coded login credentials were found in HPE"
  },
  {
    "title": "3,500 Websites Hijacked to Secretly Mine Crypto Using Stealth JavaScript and WebSocket Tactics",
    "link": "https://thehackernews.com/2025/07/3500-websites-hijacked-to-secretly-mine.html",
    "published": "Mon, 21 Jul 2025 08:30:00 +0530",
    "summary": "A new attack campaign has compromised more than 3,500 websites worldwide with JavaScript cryptocurrency miners, marking the return of browser-based cryptojacking attacks once popularized by the likes of CoinHive.&nbsp;\nAlthough the service has since shuttered after browser makers took steps to ban miner-related apps and add-ons, researchers from the c/side said they found evidence of a stealthy"
  },
  {
    "title": "EncryptHub Targets Web3 Developers Using Fake AI Platforms to Deploy Fickle Stealer Malware",
    "link": "https://thehackernews.com/2025/07/encrypthub-targets-web3-developers.html",
    "published": "Sun, 20 Jul 2025 21:43:00 +0530",
    "summary": "The financially motivated threat actor known as EncryptHub (aka LARVA-208 and Water Gamayun) has been attributed to a new campaign that's targeting Web3 developers to infect them with information stealer malware.\n\"LARVA-208 has evolved its tactics, using fake AI platforms (e.g., Norlax AI, mimicking Teampilot) to lure victims with job offers or portfolio review requests,\" Swiss cybersecurity"
  },
  {
    "title": "Critical Unpatched SharePoint Zero-Day Actively Exploited, Breaches 75+ Company Servers",
    "link": "https://thehackernews.com/2025/07/critical-microsoft-sharepoint-flaw.html",
    "published": "Sun, 20 Jul 2025 15:22:00 +0530",
    "summary": "A critical security vulnerability in Microsoft SharePoint Server has been weaponized as part of an \"active, large-scale\" exploitation campaign.\nThe zero-day flaw, tracked as CVE-2025-53770 (CVSS score: 9.8), has been described as a variant of CVE-2025-49704 (CVSS score: 8.8), a code injection and remote code execution bug in Microsoft SharePoint Server that was addressed by the tech giant as"
  }
]