[
  {
    "title": "Threat Actor Mimo Targets Magento and Docker to Deploy Crypto Miners and Proxyware",
    "link": "https://thehackernews.com/2025/07/threat-actor-mimo-targets-magento-and.html",
    "published": "Wed, 23 Jul 2025 22:45:00 +0530",
    "summary": "The threat actor behind the exploitation of vulnerable Craft Content Management System (CMS) instances has shifted its tactics to target Magento CMS and misconfigured Docker instances.\nThe activity has been attributed to a threat actor tracked as Mimo (aka Hezb), which has a long history of leveraging N-day security flaws in various web applications to deploy cryptocurrency miners.\n\"Although"
  },
  {
    "title": "New Coyote Malware Variant Exploits Windows UI Automation to Steal Banking Credentials",
    "link": "https://thehackernews.com/2025/07/new-coyote-malware-variant-exploits.html",
    "published": "Wed, 23 Jul 2025 18:28:00 +0530",
    "summary": "The Windows banking trojan known as Coyote has become the first known malware strain to exploit the Windows accessibility framework called UI Automation (UIA) to harvest sensitive information.\n\"The new Coyote variant is targeting Brazilian users, and uses UIA to extract credentials linked to 75 banking institutes' web addresses and cryptocurrency exchanges,\" Akamai security researcher Tomer"
  },
  {
    "title": "Kerberoasting Detections: A New Approach to a Decade-Old Challenge",
    "link": "https://thehackernews.com/2025/07/kerberoasting-detections-new-approach.html",
    "published": "Wed, 23 Jul 2025 16:30:00 +0530",
    "summary": "Security experts have been talking about Kerberoasting for over a decade, yet this attack continues to evade typical defense methods. Why? It’s because existing detections rely on brittle heuristics and static rules, which don’t hold up for detecting potential attack patterns in highly variable Kerberos traffic. They frequently generate false positives or miss “low-and-slow” attacks altogether.&"
  },
  {
    "title": "Google Launches OSS Rebuild to Expose Malicious Code in Widely Used Open-Source Packages",
    "link": "https://thehackernews.com/2025/07/google-launches-oss-rebuild-to-expose.html",
    "published": "Wed, 23 Jul 2025 14:58:00 +0530",
    "summary": "Google has announced the launch of a new initiative called OSS Rebuild to bolster the security of the open-source package ecosystems and prevent software supply chain attacks.\n\"As supply chain attacks continue to target widely-used dependencies, OSS Rebuild gives security teams powerful data to avoid compromise without burden on upstream maintainers,\" Matthew Suozzo, Google Open Source Security"
  },
  {
    "title": "CISA Orders Urgent Patching After Chinese Hackers Exploit SharePoint Flaws in Live Attacks",
    "link": "https://thehackernews.com/2025/07/cisa-orders-urgent-patching-after.html",
    "published": "Wed, 23 Jul 2025 11:54:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA), on July 22, 2025, added two Microsoft SharePoint flaws, CVE-2025-49704 and CVE-2025-49706, to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nTo that end, Federal Civilian Executive Branch (FCEB) agencies are required to remediate identified vulnerabilities by July 23, 2025.\n\"CISA is"
  },
  {
    "title": "CISA Warns: SysAid Flaws Under Active Attack Enable Remote File Access and SSRF",
    "link": "https://thehackernews.com/2025/07/cisa-warns-sysaid-flaws-under-active.html",
    "published": "Wed, 23 Jul 2025 11:53:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added two security flaws impacting SysAid IT support software to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-2775 (CVSS score: 9.3) - An improper restriction of XML external entity (XXE) reference vulnerability in the"
  },
  {
    "title": "Microsoft Links Ongoing SharePoint Exploits to Three Chinese Hacker Groups",
    "link": "https://thehackernews.com/2025/07/microsoft-links-ongoing-sharepoint.html",
    "published": "Tue, 22 Jul 2025 21:15:00 +0530",
    "summary": "Microsoft has formally tied the exploitation of security flaws in internet-facing SharePoint Server instances to two Chinese hacking groups called Linen Typhoon and Violet Typhoon as early as July 7, 2025, corroborating earlier reports.\nThe tech giant said it also observed a third China-based threat actor, which it tracks as Storm-2603, weaponizing the flaws as well to obtain initial access to"
  },
  {
    "title": "Cisco Confirms Active Exploits Targeting ISE Flaws Enabling Unauthenticated Root Access",
    "link": "https://thehackernews.com/2025/07/cisco-confirms-active-exploits.html",
    "published": "Tue, 22 Jul 2025 18:38:00 +0530",
    "summary": "Cisco on Monday updated its advisory of a set of recently disclosed security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) to acknowledge active exploitation.\n\"In July 2025, the Cisco PSIRT [Product Security Incident Response Team], became aware of attempted exploitation of some of these vulnerabilities in the wild,\" the company said in an alert.\nThe"
  },
  {
    "title": "Credential Theft and Remote Access Surge as AllaKore, PureRAT, and Hijack Loader Proliferate",
    "link": "https://thehackernews.com/2025/07/credential-theft-and-remote-access.html",
    "published": "Tue, 22 Jul 2025 18:30:00 +0530",
    "summary": "Mexican organizations are still being targeted by threat actors to deliver a modified version of AllaKore RAT and SystemBC as part of a long-running campaign.&nbsp;\nThe activity has been attributed by Arctic Wolf Labs to a financially motivated hacking group called Greedy Sponge. It's believed to be active since early 2021, indiscriminately targeting a wide range of sectors, such as retail,"
  },
  {
    "title": "How to Advance from SOC Manager to CISO?",
    "link": "https://thehackernews.com/2025/07/how-to-advance-from-soc-manager-to-ciso.html",
    "published": "Tue, 22 Jul 2025 16:30:00 +0530",
    "summary": "Making the move from managing a security operations center (SOC) to being a chief information security officer (CISO) is a significant career leap. Not only do you need a solid foundation of tech knowledge but also leadership skills and business smarts.&nbsp;\nThis article will guide you through the practical steps and skills you’ll need to nab an executive cybersecurity job and make the"
  }
]