[
  {
    "title": "U.S. Sanctions Firm Behind N. Korean IT Scheme; Arizona Woman Jailed for Running Laptop Farm",
    "link": "https://thehackernews.com/2025/07/us-sanctions-firm-behind-n-korean-it.html",
    "published": "Fri, 25 Jul 2025 20:35:00 +0530",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) sanctioned a North Korean front company and three associated individuals for their involvement in the fraudulent remote information technology (IT) worker scheme designed to generate illicit revenues for Pyongyang.\nThe sanctions target Korea Sobaeksu Trading Company (aka Sobaeksu United Corporation), and Kim Se Un, Jo"
  },
  {
    "title": "Patchwork Targets Turkish Defense Firms with Spear-Phishing Using Malicious LNK Files",
    "link": "https://thehackernews.com/2025/07/patchwork-targets-turkish-defense-firms.html",
    "published": "Fri, 25 Jul 2025 19:45:00 +0530",
    "summary": "The threat actor known as Patchwork has been attributed to a new spear-phishing campaign targeting Turkish defense contractors with the goal of gathering strategic intelligence.\n\"The campaign employs a five-stage execution chain delivered via malicious LNK files disguised as conference invitations sent to targets interested in learning more about unmanned vehicle systems,\" Arctic Wolf Labs said"
  },
  {
    "title": "Cyber Espionage Campaign Hits Russian Aerospace Sector Using EAGLET Backdoor",
    "link": "https://thehackernews.com/2025/07/cyber-espionage-campaign-hits-russian.html",
    "published": "Fri, 25 Jul 2025 18:44:00 +0530",
    "summary": "Russian aerospace and defense industries have become the target of a cyber espionage campaign that delivers a backdoor called EAGLET to facilitate data exfiltration.\nThe activity, dubbed Operation CargoTalon, has been assigned to a threat cluster tracked as UNG0901 (short for Unknown Group 901).\n\"The campaign is aimed at targeting employees of Voronezh Aircraft Production Association (VASO), one"
  },
  {
    "title": "Soco404 and Koske Malware Target Cloud Services with Cross-Platform Cryptomining Attacks",
    "link": "https://thehackernews.com/2025/07/soco404-and-koske-malware-target-cloud.html",
    "published": "Fri, 25 Jul 2025 16:03:00 +0530",
    "summary": "Threat hunters have disclosed two different malware campaigns that have targeted vulnerabilities and misconfigurations across cloud environments to deliver cryptocurrency miners.\nThe threat activity clusters have been codenamed Soco404 and Koske by cloud security firms Wiz and Aqua, respectively.\nSoco404 \"targets both Linux and Windows systems, deploying platform-specific malware,\" Wiz"
  },
  {
    "title": "Overcoming Risks from Chinese GenAI Tool Usage",
    "link": "https://thehackernews.com/2025/07/overcoming-risks-from-chinese-genai.html",
    "published": "Fri, 25 Jul 2025 15:55:00 +0530",
    "summary": "A recent analysis of enterprise data suggests that generative AI tools developed in China are being used extensively by employees in the US and UK, often without oversight or approval from security teams. The study, conducted by Harmonic Security, also identifies hundreds of instances in which sensitive data was uploaded to platforms hosted in China, raising concerns over compliance, data"
  },
  {
    "title": "Critical Mitel Flaw Lets Hackers Bypass Login, Gain Full Access to MiVoice MX-ONE Systems",
    "link": "https://thehackernews.com/2025/07/critical-mitel-flaw-lets-hackers-bypass.html",
    "published": "Thu, 24 Jul 2025 22:44:00 +0530",
    "summary": "Mitel has released security updates to address a critical security flaw in MiVoice MX-ONE that could allow an attacker to bypass authentication protections.\n\"An authentication bypass vulnerability has been identified in the Provisioning Manager component of Mitel MiVoice MX-ONE, which, if successfully exploited, could allow an unauthenticated attacker to conduct an authentication bypass attack"
  },
  {
    "title": "Fire Ant Exploits VMware Flaws to Compromise ESXi Hosts and vCenter Environments",
    "link": "https://thehackernews.com/2025/07/fire-ant-exploits-vmware-flaw-to.html",
    "published": "Thu, 24 Jul 2025 22:35:00 +0530",
    "summary": "Virtualization and networking infrastructure have been targeted by a threat actor codenamed Fire Ant as part of a prolonged cyber espionage campaign.\nThe activity, observed this year, is primarily designed Now to infiltrate organizations' VMware ESXi and vCenter environments as well as network appliances, Sygnia said in a new report published today.\n\"The threat actor leveraged combinations of"
  },
  {
    "title": "CastleLoader Malware Infects 469 Devices Using Fake GitHub Repos and ClickFix Phishing",
    "link": "https://thehackernews.com/2025/07/castleloader-malware-infects-469.html",
    "published": "Thu, 24 Jul 2025 20:43:00 +0530",
    "summary": "Cybersecurity researchers have shed light on a new versatile malware loader called CastleLoader that has been put to use in campaigns distributing various information stealers and remote access trojans (RATs).\nThe activity employs Cloudflare-themed ClickFix phishing attacks and fake GitHub repositories opened under the names of legitimate applications, Swiss cybersecurity company PRODAFT said in"
  },
  {
    "title": "Sophos and SonicWall Patch Critical RCE Flaws Affecting Firewalls and SMA 100 Devices",
    "link": "https://thehackernews.com/2025/07/sophos-and-sonicwall-patch-critical-rce.html",
    "published": "Thu, 24 Jul 2025 19:44:00 +0530",
    "summary": "Sophos and SonicWall have alerted users of critical security flaws in Sophos Firewall and Secure Mobile Access (SMA) 100 Series appliances that could be exploited to achieve remote code execution.&nbsp;\nThe two vulnerabilities impacting Sophos Firewall are listed below -\n\nCVE-2025-6704 (CVSS score: 9.8) - An arbitrary file writing vulnerability in the Secure PDF eXchange (SPX) feature can lead"
  },
  {
    "title": "Watch This Webinar to Uncover Hidden Flaws in Login, AI, and Digital Trust — and Fix Them",
    "link": "https://thehackernews.com/2025/07/watch-this-webinar-to-uncover-hidden.html",
    "published": "Thu, 24 Jul 2025 17:06:00 +0530",
    "summary": "Is Managing Customer Logins and Data Giving You Headaches? You're Not Alone!\nToday, we all expect super-fast, secure, and personalized online experiences. But let's be honest, we're also more careful about how our data is used. If something feels off, trust can vanish in an instant. Add to that the lightning-fast changes AI is bringing to everything from how we log in to spotting online fraud,"
  }
]