[
  {
    "title": "Wiz Uncovers Critical Access Bypass Flaw in AI-Powered Vibe Coding Platform Base44",
    "link": "https://thehackernews.com/2025/07/wiz-uncovers-critical-access-bypass.html",
    "published": "Tue, 29 Jul 2025 21:08:00 +0530",
    "summary": "Cybersecurity researchers have disclosed a now-patched critical security flaw in a popular vibe coding platform called Base44 that could allow unauthorized access to private applications built by its users.\n\"The vulnerability we discovered was remarkably simple to exploit -- by providing only a non-secret app_id value to undocumented registration and email verification endpoints, an attacker"
  },
  {
    "title": "PyPI Warns of Ongoing Phishing Campaign Using Fake Verification Emails and Lookalike Domain",
    "link": "https://thehackernews.com/2025/07/pypi-warns-of-ongoing-phishing-campaign.html",
    "published": "Tue, 29 Jul 2025 19:57:00 +0530",
    "summary": "The maintainers of the Python Package Index (PyPI) repository have issued a warning about an ongoing phishing attack that's targeting users in an attempt to redirect them to fake PyPI sites.\nThe attack involves sending email messages bearing the subject line \"[PyPI] Email verification\" that are sent from the email address noreply@pypj[.]org (note that the domain is not \"pypi[.]org\").\n\"This is"
  },
  {
    "title": "Chaos RaaS Emerges After BlackSuit Takedown, Demanding $300K from U.S. Victims",
    "link": "https://thehackernews.com/2025/07/chaos-raas-emerges-after-blacksuit.html",
    "published": "Tue, 29 Jul 2025 18:55:00 +0530",
    "summary": "A newly emerged ransomware-as-a-service (RaaS) gang called Chaos is likely made up of former members of the BlackSuit crew, as the latter's dark web infrastructure has been the subject of a law enforcement seizure.\nChaos, which sprang forth in February 2025, is the latest entrant in the ransomware landscape to conduct big-game hunting and double extortion attacks.\n\"Chaos RaaS actors initiated"
  },
  {
    "title": "How the Browser Became the Main Cyber Battleground",
    "link": "https://thehackernews.com/2025/07/how-browser-became-main-cyber.html",
    "published": "Tue, 29 Jul 2025 16:55:00 +0530",
    "summary": "Until recently, the cyber attacker methodology behind the biggest breaches of the last decade or so has been pretty consistent:\n\nCompromise an endpoint via software exploit, or social engineering a user to run malware on their device;&nbsp;\nFind ways to move laterally inside the network and compromise privileged identities;\nRepeat as needed until you can execute your desired attack — usually"
  },
  {
    "title": "Cybercriminals Use Fake Apps to Steal Data and Blackmail Users Across Asia’s Mobile Networks",
    "link": "https://thehackernews.com/2025/07/cybercriminals-use-fake-apps-to-steal.html",
    "published": "Tue, 29 Jul 2025 16:40:00 +0530",
    "summary": "Cybersecurity researchers have discovered a new, large-scale mobile malware campaign that's targeting Android and iOS platforms with fake dating, social networking, cloud storage, and car service apps to steal sensitive personal data.\nThe cross-platform threat has been codenamed SarangTrap by Zimperium zLabs. Users in South Korea appear to be the primary focus.\n\"This extensive campaign involved"
  },
  {
    "title": "Why React Didn't Kill XSS: The New JavaScript Injection Playbook",
    "link": "https://thehackernews.com/2025/07/why-react-didnt-kill-xss-new-javascript.html",
    "published": "Tue, 29 Jul 2025 15:30:00 +0530",
    "summary": "React conquered XSS? Think again. That's the reality facing JavaScript developers in 2025, where attackers have quietly evolved their injection techniques to exploit everything from prototype pollution to AI-generated code, bypassing the very frameworks designed to keep applications secure.\nFull 47-page guide with framework-specific defenses (PDF, free).\nJavaScript conquered the web, but with"
  },
  {
    "title": "CISA Adds PaperCut NG/MF CSRF Vulnerability to KEV Catalog Amid Active Exploitation",
    "link": "https://thehackernews.com/2025/07/cisa-adds-papercut-ngmf-csrf.html",
    "published": "Tue, 29 Jul 2025 10:21:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added a high-severity security vulnerability impacting PaperCutNG/MF print management software to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe vulnerability, tracked as CVE-2023-2533 (CVSS score: 8.4), is a cross-site request forgery (CSRF) bug that could"
  },
  {
    "title": "Hackers Breach Toptal GitHub, Publish 10 Malicious npm Packages With 5,000 Downloads",
    "link": "https://thehackernews.com/2025/07/hackers-breach-toptal-github-publish-10.html",
    "published": "Mon, 28 Jul 2025 23:01:00 +0530",
    "summary": "In what's the latest instance of a software supply chain attack, unknown threat actors managed to compromise Toptal's GitHub organization account and leveraged that access to publish 10 malicious packages to the npm registry.\nThe packages contained code to exfiltrate GitHub authentication tokens and destroy victim systems, Socket said in a report published last week. In addition, 73 repositories"
  },
  {
    "title": "⚡ Weekly Recap — SharePoint Breach, Spyware, IoT Hijacks, DPRK Fraud, Crypto Drains and More",
    "link": "https://thehackernews.com/2025/07/weekly-recap-sharepoint-breach-spyware.html",
    "published": "Mon, 28 Jul 2025 17:43:00 +0530",
    "summary": "Some risks don’t breach the perimeter—they arrive through signed software, clean resumes, or sanctioned vendors still hiding in plain sight.\nThis week, the clearest threats weren’t the loudest—they were the most legitimate-looking. In an environment where identity, trust, and tooling are all interlinked, the strongest attack path is often the one that looks like it belongs. Security teams are"
  },
  {
    "title": "Email Security Is Stuck in the Antivirus Era: Why It Needs a Modern Approach",
    "link": "https://thehackernews.com/2025/07/email-security-is-stuck-in-antivirus.html",
    "published": "Mon, 28 Jul 2025 16:55:00 +0530",
    "summary": "Picture this: you’ve hardened every laptop in your fleet with real‑time telemetry, rapid isolation, and automated rollback. But the corporate mailbox—the front door for most attackers—is still guarded by what is effectively a 1990s-era filter.\nThis isn't a balanced approach. Email remains a primary vector for breaches, yet we often treat it as a static stream of messages instead of a dynamic,"
  }
]