[
  {
    "title": "North Korean Hackers Use EtherHiding to Hide Malware Inside Blockchain Smart Contracts",
    "link": "https://thehackernews.com/2025/10/north-korean-hackers-use-etherhiding-to.html",
    "published": "Thu, 16 Oct 2025 20:26:00 +0530",
    "summary": "A threat actor with ties to the Democratic People's Republic of Korea (aka North Korea) has been observed leveraging the EtherHiding technique to distribute malware and enable cryptocurrency theft, marking the first time a state-sponsored hacking group has embraced the method.\nThe activity has been attributed by Google Threat Intelligence Group (GTIG) to a threat cluster it tracks as UNC5342,"
  },
  {
    "title": "Hackers Abuse Blockchain Smart Contracts to Spread Malware via Infected WordPress Sites",
    "link": "https://thehackernews.com/2025/10/hackers-abuse-blockchain-smart.html",
    "published": "Thu, 16 Oct 2025 20:22:00 +0530",
    "summary": "A financially motivated threat actor codenamed UNC5142 has been observed abusing blockchain smart contracts as a way to facilitate the distribution of information stealers such as Atomic (AMOS), Lumma, Rhadamanthys (aka RADTHIEF), and Vidar, targeting both Windows and Apple macOS systems.\n\"UNC5142 is characterized by its use of compromised WordPress websites and 'EtherHiding,' a technique used"
  },
  {
    "title": "LinkPro Linux Rootkit Uses eBPF to Hide and Activates via Magic TCP Packets",
    "link": "https://thehackernews.com/2025/10/linkpro-linux-rootkit-uses-ebpf-to-hide.html",
    "published": "Thu, 16 Oct 2025 19:58:00 +0530",
    "summary": "An investigation into the compromise of an Amazon Web Services (AWS)-hosted infrastructure has led to the discovery of a new GNU/Linux rootkit dubbed LinkPro, according to findings from Synacktiv.\n\"This backdoor features functionalities relying on the installation of two eBPF [extended Berkeley Packet Filter] modules, on the one hand to conceal itself, and on the other hand to be remotely"
  },
  {
    "title": "Architectures, Risks, and Adoption: How to Assess and Choose the Right AI-SOC Platform",
    "link": "https://thehackernews.com/2025/10/architectures-risks-and-adoption-how-to.html",
    "published": "Thu, 16 Oct 2025 17:25:00 +0530",
    "summary": "Scaling the SOC with AI - Why now?&nbsp;\nSecurity Operations Centers (SOCs) are under unprecedented pressure. According to SACR’s AI-SOC Market Landscape 2025, the average organization now faces around 960 alerts per day, while large enterprises manage more than 3,000 alerts daily from an average of 28 different tools. Nearly 40% of those alerts go uninvestigated, and 61% of security teams admit"
  },
  {
    "title": "Hackers Deploy Linux Rootkits via Cisco SNMP Flaw in \"Zero Disco' Attacks",
    "link": "https://thehackernews.com/2025/10/hackers-deploy-linux-rootkits-via-cisco.html",
    "published": "Thu, 16 Oct 2025 17:08:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that exploited a recently disclosed security flaw impacting Cisco IOS Software and IOS XE Software to deploy Linux rootkits on older, unprotected systems.\nThe activity, codenamed Operation Zero Disco by Trend Micro, involves the weaponization of CVE-2025-20352 (CVSS score: 7.7), a stack overflow vulnerability in the Simple"
  },
  {
    "title": "Beware the Hidden Costs of Pen Testing",
    "link": "https://thehackernews.com/2025/10/beware-hidden-costs-of-pen-testing.html",
    "published": "Thu, 16 Oct 2025 16:20:00 +0530",
    "summary": "Penetration testing helps organizations ensure IT systems are secure, but it should never be treated in a one-size-fits-all approach. Traditional approaches can be rigid and cost your organization time and money – while producing inferior results.&nbsp;\nThe benefits of pen testing are clear. By empowering “white hat” hackers to attempt to breach your system using similar tools and techniques to"
  },
  {
    "title": "ThreatsDay Bulletin: $15B Crypto Bust, Satellite Spying, Billion-Dollar Smishing, Android RATs & More",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-15b-crypto-bust.html",
    "published": "Thu, 16 Oct 2025 14:44:00 +0530",
    "summary": "The online world is changing fast. Every week, new scams, hacks, and tricks show how easy it’s become to turn everyday technology into a weapon. Tools made to help us work, connect, and stay safe are now being used to steal, spy, and deceive.\nHackers don’t always break systems anymore — they use them. They hide inside trusted apps, copy real websites, and trick people into giving up control"
  },
  {
    "title": "CISA Flags Adobe AEM Flaw with Perfect 10.0 Score — Already Under Active Attack",
    "link": "https://thehackernews.com/2025/10/cisa-flags-adobe-aem-flaw-with-perfect.html",
    "published": "Thu, 16 Oct 2025 09:56:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical security flaw impacting Adobe Experience Manager to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerability in question is CVE-2025-54253 (CVSS score: 10.0), a maximum-severity misconfiguration bug that could result in arbitrary code execution."
  },
  {
    "title": "Chinese Threat Group 'Jewelbug' Quietly Infiltrated Russian IT Network for Months",
    "link": "https://thehackernews.com/2025/10/chinese-threat-group-jewelbug-quietly.html",
    "published": "Wed, 15 Oct 2025 22:58:00 +0530",
    "summary": "A threat actor with ties to China has been attributed to a five-month-long intrusion targeting a Russian IT service provider, marking the hacking group's expansion to the country beyond Southeast Asia and South America.\nThe activity, which took place from January to May 2025, has been attributed by Broadcom-owned Symantec to a threat actor it tracks as Jewelbug, which it said overlaps with"
  },
  {
    "title": "F5 Breach Exposes BIG-IP Source Code — Nation-State Hackers Behind Massive Intrusion",
    "link": "https://thehackernews.com/2025/10/f5-breach-exposes-big-ip-source-code.html",
    "published": "Wed, 15 Oct 2025 21:36:00 +0530",
    "summary": "U.S. cybersecurity company F5 on Wednesday disclosed that unidentified threat actors broke into its systems and stole files containing some of BIG-IP's source code and information related to undisclosed vulnerabilities in the product.\nIt attributed the activity to a \"highly sophisticated nation-state threat actor,\" adding the adversary maintained long-term, persistent access to its network. The"
  }
]