[
  {
    "title": "Google's Built-In AI Defenses on Android Now Block 10 Billion Scam Messages a Month",
    "link": "https://thehackernews.com/2025/10/googles-built-in-ai-defenses-on-android.html",
    "published": "Thu, 30 Oct 2025 22:30:00 +0530",
    "summary": "Google on Thursday revealed that the scam defenses built into Android safeguard users around the world from more than 10 billion suspected malicious calls and messages every month.\nThe tech giant also said it has blocked over 100 million suspicious numbers from using Rich Communication Services (RCS), an evolution of the SMS protocol, thereby preventing scams before they could even be sent.\nIn"
  },
  {
    "title": "Russian Ransomware Gangs Weaponize Open-Source AdaptixC2 for Advanced Attacks",
    "link": "https://thehackernews.com/2025/10/russian-ransomware-gangs-weaponize-open.html",
    "published": "Thu, 30 Oct 2025 22:10:00 +0530",
    "summary": "The open-source command-and-control (C2) framework known as AdaptixC2 is being used by a growing number of threat actors, some of whom are related to Russian ransomware gangs.\nAdaptixC2 is an emerging extensible post-exploitation and adversarial emulation framework designed for penetration testing. While the server component is written in Golang, the GUI Client is written in C++ QT for"
  },
  {
    "title": "New \"Brash\" Exploit Crashes Chromium Browsers Instantly with a Single Malicious URL",
    "link": "https://thehackernews.com/2025/10/new-brash-exploit-crashes-chromium.html",
    "published": "Thu, 30 Oct 2025 20:15:00 +0530",
    "summary": "A severe vulnerability disclosed in Chromium's Blink rendering engine can be exploited to crash many Chromium-based browsers within a few seconds.\nSecurity researcher Jose Pino, who disclosed details of the flaw, has codenamed it Brash.\n\"It allows any Chromium browser to collapse in 15-60 seconds by exploiting an architectural flaw in how certain DOM operations are managed,\" Pino said in a"
  },
  {
    "title": "The Death of the Security Checkbox: BAS Is the Power Behind Real Defense",
    "link": "https://thehackernews.com/2025/10/the-death-of-security-checkbox-bas-is.html",
    "published": "Thu, 30 Oct 2025 17:25:00 +0530",
    "summary": "Security doesn’t fail at the point of breach. It fails at the point of impact.&nbsp;\nThat line set the tone for this year’s Picus Breach and Simulation (BAS) Summit, where researchers, practitioners, and CISOs all echoed the same theme: cyber defense is no longer about prediction. It's about proof.\nWhen a new exploit drops, scanners scour the internet in minutes. Once attackers gain a foothold,"
  },
  {
    "title": "ThreatsDay Bulletin: DNS Poisoning Flaw, Supply-Chain Heist, Rust Malware Trick and New RATs Rising",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-dns-poisoning-flaw.html",
    "published": "Thu, 30 Oct 2025 16:24:00 +0530",
    "summary": "The comfort zone in cybersecurity is gone. Attackers are scaling down, focusing tighter, and squeezing more value from fewer, high-impact targets. At the same time, defenders face growing blind spots &mdash; from spoofed messages to large-scale social engineering.\nThis week&rsquo;s findings show how that shrinking margin of safety is redrawing the threat landscape. Here&rsquo;s what&rsquo;s"
  },
  {
    "title": "PhantomRaven Malware Found in 126 npm Packages Stealing GitHub Tokens From Devs",
    "link": "https://thehackernews.com/2025/10/phantomraven-malware-found-in-126-npm.html",
    "published": "Thu, 30 Oct 2025 15:46:00 +0530",
    "summary": "Cybersecurity researchers have uncovered yet another active software supply chain attack campaign targeting the npm registry with over 100 malicious packages that can steal authentication tokens, CI/CD secrets, and GitHub credentials from developers' machines.\nThe campaign has been codenamed PhantomRaven by Koi Security. The activity is assessed to have begun in August 2025, when the first"
  },
  {
    "title": "Experts Reports Sharp Increase in Automated Botnet Attacks Targeting PHP Servers and IoT Devices",
    "link": "https://thehackernews.com/2025/10/experts-reports-sharp-increase-in.html",
    "published": "Wed, 29 Oct 2025 21:08:00 +0530",
    "summary": "Cybersecurity researchers are calling attention to a spike in automated attacks targeting PHP servers, IoT devices, and cloud gateways by various botnets such as Mirai, Gafgyt, and Mozi.\n\"These automated campaigns exploit known CVE vulnerabilities and cloud misconfigurations to gain control over exposed systems and expand botnet networks,\" the Qualys Threat Research Unit (TRU) said in a report"
  },
  {
    "title": "New AI-Targeted Cloaking Attack Tricks AI Crawlers Into Citing Fake Info as Verified Facts",
    "link": "https://thehackernews.com/2025/10/new-ai-targeted-cloaking-attack-tricks.html",
    "published": "Wed, 29 Oct 2025 20:27:00 +0530",
    "summary": "Cybersecurity researchers have flagged a new security issue in agentic web browsers like OpenAI ChatGPT Atlas that exposes underlying artificial intelligence (AI) models to context poisoning attacks.\nIn the attack devised by AI security company SPLX, a bad actor can set up websites that serve different content to browsers and AI crawlers run by ChatGPT and Perplexity. The technique has been"
  },
  {
    "title": "Discover Practical AI Tactics for GRC — Join the Free Expert Webinar",
    "link": "https://thehackernews.com/2025/10/discover-practical-ai-tactics-for-grc.html",
    "published": "Wed, 29 Oct 2025 17:28:00 +0530",
    "summary": "Artificial Intelligence (AI) is rapidly transforming Governance, Risk, and Compliance (GRC). It's no longer a future concept—it's here, and it's already reshaping how teams operate.\nAI's capabilities are profound: it's speeding up audits, flagging critical risks faster, and drastically cutting down on time-consuming manual work. This leads to greater efficiency, higher accuracy, and a more"
  },
  {
    "title": "Preparing for the Digital Battlefield of 2026: Ghost Identities, Poisoned Accounts, & AI Agent Havoc",
    "link": "https://thehackernews.com/2025/10/preparing-for-digital-battlefield-of.html",
    "published": "Wed, 29 Oct 2025 17:25:00 +0530",
    "summary": "BeyondTrust’s annual cybersecurity predictions point to a year where old defenses will fail quietly, and new attack vectors will surge.\nIntroduction\nThe next major breach won’t be a phished password. It will be the result of a massive, unmanaged identity debt. This debt takes many forms: it’s the “ghost” identity from a 2015 breach lurking in your IAM, the privilege sprawl from thousands of new"
  }
]