[
  {
    "title": "New Report Links Research Firms BIETA and CIII to China’s MSS Cyber Operations",
    "link": "https://thehackernews.com/2025/10/new-report-links-research-firms-bieta.html",
    "published": "Mon, 06 Oct 2025 19:30:00 +0530",
    "summary": "A Chinese company named the Beijing Institute of Electronics Technology and Application (BIETA) has been assessed to be likely led by the Ministry of State Security (MSS).\nThe assessment comes from evidence that at least four BIETA personnel have clear or possible links to MSS officers and their relationship with the University of International Relations, which is known to share links with the"
  },
  {
    "title": "⚡ Weekly Recap: Oracle 0-Day, BitLocker Bypass, VMScape, WhatsApp Worm & More",
    "link": "https://thehackernews.com/2025/10/weekly-recap-oracle-0-day-bitlocker.html",
    "published": "Mon, 06 Oct 2025 17:08:00 +0530",
    "summary": "The cyber world never hits pause, and staying alert matters more than ever. Every week brings new tricks, smarter attacks, and fresh lessons from the field.\nThis recap cuts through the noise to share what really matters—key trends, warning signs, and stories shaping today’s security landscape. Whether you’re defending systems or just keeping up, these highlights help you spot what’s coming"
  },
  {
    "title": "5 Critical Questions For Adopting an AI Security Solution",
    "link": "https://thehackernews.com/2025/10/5-critical-questions-for-adopting-ai.html",
    "published": "Mon, 06 Oct 2025 17:08:00 +0530",
    "summary": "In the era of rapidly advancing artificial intelligence (AI) and cloud technologies, organizations are increasingly implementing security measures to protect sensitive data and ensure regulatory compliance. Among these measures, AI-SPM (AI Security Posture Management) solutions have gained traction to secure AI pipelines, sensitive data assets, and the overall AI ecosystem. These solutions help"
  },
  {
    "title": "Oracle Rushes Patch for CVE-2025-61882 After Cl0p Exploited It in Data Theft Attacks",
    "link": "https://thehackernews.com/2025/10/oracle-rushes-patch-for-cve-2025-61882.html",
    "published": "Mon, 06 Oct 2025 17:07:00 +0530",
    "summary": "Oracle has released an emergency update to address a critical security flaw in its E-Business Suite that it said has been exploited in the recent wave of Cl0p data theft attacks.\nThe vulnerability, tracked as CVE-2025-61882 (CVSS score: 9.8), concerns an unspecified bug that could allow an unauthenticated attacker with network access via HTTP to compromise and take control of the Oracle"
  },
  {
    "title": "Chinese Cybercrime Group Runs Global SEO Fraud Ring Using Compromised IIS Servers",
    "link": "https://thehackernews.com/2025/10/chinese-cybercrime-group-runs-global.html",
    "published": "Mon, 06 Oct 2025 17:06:00 +0530",
    "summary": "Cybersecurity researchers have shed light on a Chinese-speaking cybercrime group codenamed UAT-8099 that has been attributed to search engine optimization (SEO) fraud and theft of high-value credentials, configuration files, and certificate data.&nbsp;\nThe attacks are designed to target Microsoft Internet Information Services (IIS) servers, with most of the infections reported in India, Thailand"
  },
  {
    "title": "Zimbra Zero-Day Exploited to Target Brazilian Military via Malicious ICS Files",
    "link": "https://thehackernews.com/2025/10/zimbra-zero-day-exploited-to-target.html",
    "published": "Mon, 06 Oct 2025 11:31:00 +0530",
    "summary": "A now patched security vulnerability in Zimbra Collaboration was exploited as a zero-day earlier this year in cyber attacks targeting the Brazilian military.\nTracked as CVE-2025-27915 (CVSS score: 5.4), the vulnerability is a stored cross-site scripting (XSS) vulnerability in the Classic Web Client that arises as a result of insufficient sanitization of HTML content in ICS calendar files,"
  },
  {
    "title": "CometJacking: One Click Can Turn Perplexity’s Comet AI Browser Into a Data Thief",
    "link": "https://thehackernews.com/2025/10/cometjacking-one-click-can-turn.html",
    "published": "Sat, 04 Oct 2025 20:07:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new attack called CometJacking targeting Perplexity's agentic AI browser Comet by embedding malicious prompts within a seemingly innocuous link to siphon sensitive data, including from connected services, like email and calendar.\nThe sneaky prompt injection attack plays out in the form of a malicious link that, when clicked, triggers the"
  },
  {
    "title": "Scanning Activity on Palo Alto Networks Portals Jump 500% in One Day",
    "link": "https://thehackernews.com/2025/10/scanning-activity-on-palo-alto-networks.html",
    "published": "Sat, 04 Oct 2025 16:09:00 +0530",
    "summary": "Threat intelligence firm GreyNoise disclosed on Friday that it has observed a massive spike in scanning activity targeting Palo Alto Networks login portals.\nThe company said it observed a nearly 500% increase in IP addresses scanning Palo Alto Networks login portals on October 3, 2025, the highest level recorded in the last three months. It described the traffic as targeted and structured, and"
  },
  {
    "title": "Detour Dog Caught Running DNS-Powered Malware Factory for Strela Stealer",
    "link": "https://thehackernews.com/2025/10/detour-dog-caught-running-dns-powered.html",
    "published": "Fri, 03 Oct 2025 23:41:00 +0530",
    "summary": "A threat actor named Detour Dog has been outed as powering campaigns distributing an information stealer known as Strela Stealer.\nThat's according to findings from Infoblox, which found the threat actor to maintain control of domains hosting the first stage of the stealer, a backdoor called StarFish.\nThe DNS threat intelligence firm said it has been tracking Detour Dog since August 2023, when"
  },
  {
    "title": "Rhadamanthys Stealer Evolves: Adds Device Fingerprinting, PNG Steganography Payloads",
    "link": "https://thehackernews.com/2025/10/rhadamanthys-stealer-evolves-adds.html",
    "published": "Fri, 03 Oct 2025 21:28:00 +0530",
    "summary": "The threat actor behind Rhadamanthys has also advertised two other tools called Elysium Proxy Bot and Crypt Service on their website, even as the flagship information stealer has been updated to support the ability to collect device and web browser fingerprints, among others.\n\"Rhadamanthys was initially promoted through posts on cybercrime forums, but soon it became clear that the author had a"
  }
]