[
  {
    "title": "From HealthKick to GOVERSHELL: The Evolution of UTA0388's Espionage Malware",
    "link": "https://thehackernews.com/2025/10/from-healthkick-to-govershell-evolution.html",
    "published": "Thu, 09 Oct 2025 22:49:00 +0530",
    "summary": "A China-aligned threat actor codenamed UTA0388 has been attributed to a series of spear-phishing campaigns targeting North America, Asia, and Europe that are designed to deliver a Go-based implant known as GOVERSHELL.\n\"The initially observed campaigns were tailored to the targets, and the messages purported to be sent by senior researchers and analysts from legitimate-sounding, completely"
  },
  {
    "title": "New ClayRat Spyware Targets Android Users via Fake WhatsApp and TikTok Apps",
    "link": "https://thehackernews.com/2025/10/new-clayrat-spyware-targets-android.html",
    "published": "Thu, 09 Oct 2025 21:00:00 +0530",
    "summary": "A rapidly evolving Android spyware campaign called ClayRat has targeted users in Russia using a mix of Telegram channels and lookalike phishing websites by impersonating popular apps like WhatsApp, Google Photos, TikTok, and YouTube as lures to install them.\n\"Once active, the spyware can exfiltrate SMS messages, call logs, notifications, and device information; taking photos with the front"
  },
  {
    "title": "Hackers Access SonicWall Cloud Firewall Backups, Spark Urgent Security Checks",
    "link": "https://thehackernews.com/2025/10/hackers-access-sonicwall-cloud-firewall.html",
    "published": "Thu, 09 Oct 2025 19:18:00 +0530",
    "summary": "SonicWall on Wednesday disclosed that an unauthorized party accessed firewall configuration backup files for all customers who have used the cloud backup service.\n\"The files contain encrypted credentials and configuration data; while encryption remains in place, possession of these files could increase the risk of targeted attacks,\" the company said.\nIt also noted that it's working to notify all"
  },
  {
    "title": "ThreatsDay Bulletin: MS Teams Hack, MFA Hijacking, $2B Crypto Heist, Apple Siri Probe & More",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-ms-teams-hack-mfa.html",
    "published": "Thu, 09 Oct 2025 17:46:00 +0530",
    "summary": "Cyber threats are evolving faster than ever. Attackers now combine social engineering, AI-driven manipulation, and cloud exploitation to breach targets once considered secure. From communication platforms to connected devices, every system that enhances convenience also expands the attack surface.\nThis edition of ThreatsDay Bulletin explores these converging risks and the safeguards that help"
  },
  {
    "title": "SaaS Breaches Start with Tokens - What Security Teams Must Watch",
    "link": "https://thehackernews.com/2025/10/saas-breaches-start-with-tokens-what.html",
    "published": "Thu, 09 Oct 2025 17:00:00 +0530",
    "summary": "Token theft is a leading cause of SaaS breaches. Discover why OAuth and API tokens are often overlooked and how security teams can strengthen token hygiene to prevent attacks.\nMost companies in 2025 rely on a whole range of software-as-a-service (SaaS) applications to run their operations. However, the security of these applications depends on small pieces of data called tokens. Tokens, like"
  },
  {
    "title": "From Phishing to Malware: AI Becomes Russia's New Cyber Weapon in War on Ukraine",
    "link": "https://thehackernews.com/2025/10/from-phishing-to-malware-ai-becomes.html",
    "published": "Thu, 09 Oct 2025 14:40:00 +0530",
    "summary": "Russian hackers' adoption of artificial intelligence (AI) in cyber attacks against Ukraine has reached a new level in the first half of 2025 (H1 2025), the country's State Service for Special Communications and Information Protection (SSSCIP) said.\n\"Hackers now employ it not only to generate phishing messages, but some of the malware samples we have analyzed show clear signs of being generated"
  },
  {
    "title": "Critical Exploit Lets Hackers Bypass Authentication in WordPress Service Finder Theme",
    "link": "https://thehackernews.com/2025/10/critical-exploit-lets-hackers-bypass.html",
    "published": "Thu, 09 Oct 2025 12:27:00 +0530",
    "summary": "Threat actors are actively exploiting a critical security flaw impacting the Service Finder WordPress theme that makes it possible to gain unauthorized access to any account, including administrators, and take control of susceptible sites.\nThe authentication bypass vulnerability, tracked as CVE-2025-5947 (CVSS score: 9.8), affects the Service Finder Bookings, a WordPress plugin bundled with the"
  },
  {
    "title": "Hackers Exploit WordPress Sites to Power Next-Gen ClickFix Phishing Attacks",
    "link": "https://thehackernews.com/2025/10/hackers-exploit-wordpress-themes-to.html",
    "published": "Wed, 08 Oct 2025 22:13:00 +0530",
    "summary": "Cybersecurity researchers are calling attention to a nefarious campaign targeting WordPress sites to make malicious JavaScript injections that are designed to redirect users to sketchy sites.\n\"Site visitors get injected content that was drive-by malware like fake Cloudflare verification,\" Sucuri researcher Puja Srivastava said in an analysis published last week.\nThe website security company"
  },
  {
    "title": "Chinese Hackers Weaponize Open-Source Nezha Tool in New Attack Wave",
    "link": "https://thehackernews.com/2025/10/chinese-hackers-weaponize-open-source.html",
    "published": "Wed, 08 Oct 2025 19:26:00 +0530",
    "summary": "Threat actors with suspected ties to China have turned a legitimate open-source monitoring tool called Nezha into an attack weapon, using it to deliver a known malware called Gh0st RAT to targets.\nThe activity, observed by cybersecurity company Huntress in August 2025, is characterized by the use of an unusual technique called log poisoning (aka log injection) to plant a web shell on a web"
  },
  {
    "title": "Step Into the Password Graveyard… If You Dare (and Join the Live Session)",
    "link": "https://thehackernews.com/2025/10/step-into-password-graveyard-if-you.html",
    "published": "Wed, 08 Oct 2025 17:38:00 +0530",
    "summary": "Every year, weak passwords lead to millions in losses — and many of those breaches could have been stopped.\nAttackers don’t need advanced tools; they just need one careless login.\nFor IT teams, that means endless resets, compliance struggles, and sleepless nights worrying about the next credential leak.\nThis Halloween, The Hacker News and Specops Software invite you to a live webinar: “"
  }
]