[
  {
    "title": "DoJ Seizes $61 Million in Tether Linked to Pig Butchering Crypto Scams",
    "link": "https://thehackernews.com/2026/02/doj-seizes-61-million-in-tether-linked.html",
    "published": "Fri, 27 Feb 2026 23:41:00 +0530",
    "summary": "The U.S. Department of Justice (DoJ) this week announced the seizure of $61 million worth of Tether that were allegedly associated with bogus cryptocurrency schemes known as pig butchering.\nThe confiscated funds were traced to cryptocurrency addresses used for the laundering of criminally derived proceeds stolen from victims of cryptocurrency investment scams, the department added.\n\"Criminal"
  },
  {
    "title": "900+ Sangoma FreePBX Instances Compromised in Ongoing Web Shell Attacks",
    "link": "https://thehackernews.com/2026/02/900-sangoma-freepbx-instances.html",
    "published": "Fri, 27 Feb 2026 23:29:00 +0530",
    "summary": "The Shadowserver Foundation has revealed that over 900 Sangoma FreePBX instances still remain infected with web shells as part of attacks that exploited a command injection vulnerability starting in December 2025.\nOf these, 401 instances are located in the U.S., followed by 51 in Brazil, 43 in Canada, 40 in Germany, and 36 in France.\nThe non-profit entity said the compromises are likely"
  },
  {
    "title": "Malicious Go Crypto Module Steals Passwords, Deploys Rekoobe Backdoor",
    "link": "https://thehackernews.com/2026/02/malicious-go-crypto-module-steals.html",
    "published": "Fri, 27 Feb 2026 21:03:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a malicious Go module that's designed to harvest passwords, create persistent access via SSH, and deliver a Linux backdoor named Rekoobe.\nThe Go module, github[.]com/xinfeisoft/crypto, impersonates the legitimate \"golang.org/x/crypto\" codebase, but injects malicious code that's responsible for exfiltrating secrets entered via terminal password"
  },
  {
    "title": "ScarCruft Uses Zoho WorkDrive and USB Malware to Breach Air-Gapped Networks",
    "link": "https://thehackernews.com/2026/02/scarcruft-uses-zoho-workdrive-and-usb.html",
    "published": "Fri, 27 Feb 2026 18:13:00 +0530",
    "summary": "The North Korean threat actor known as ScarCruft has been attributed to a fresh set of tools, including a backdoor that uses Zoho WorkDrive for command-and-control (C2) communications to fetch more payloads and an implant that uses removable media to relay commands and breach air-gapped networks.\nThe campaign, codenamed Ruby Jumper by Zscaler ThreatLabz, involves the deployment of malware"
  },
  {
    "title": "Trojanized Gaming Tools Spread Java-Based RAT via Browser and Chat Platforms",
    "link": "https://thehackernews.com/2026/02/trojanized-gaming-tools-spread-java.html",
    "published": "Fri, 27 Feb 2026 15:36:00 +0530",
    "summary": "Threat actors are luring unsuspecting users into running trojanized gaming utilities that are distributed via browsers and chat platforms to distribute a remote access trojan (RAT).\n\"A malicious downloader staged a portable Java runtime and executed a malicious Java archive (JAR) file named jd-gui.jar,\" the Microsoft Threat Intelligence team said in a post on X. \"This downloader used PowerShell"
  },
  {
    "title": "Meta Files Lawsuits Against Brazil, China, Vietnam Advertisers Over Celeb-Bait Scams",
    "link": "https://thehackernews.com/2026/02/meta-files-lawsuits-against-brazil.html",
    "published": "Fri, 27 Feb 2026 13:26:00 +0530",
    "summary": "Meta on Thursday said it's taking legal action to tackle scams on its platforms by filing lawsuits against what it calls deceptive advertisers based in Brazil, China, and Vietnam.\nAs part of the effort, the advertisers' methods of payment have been suspended, related accounts have been disabled, and the website domain names used to pull off the scams have been blocked.\nConcurrently, the social"
  },
  {
    "title": "Aeternum C2 Botnet Stores Encrypted Commands on Polygon Blockchain to Evade Takedown",
    "link": "https://thehackernews.com/2026/02/aeternum-c2-botnet-stores-encrypted.html",
    "published": "Thu, 26 Feb 2026 23:30:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new botnet loader called Aeternum C2 that uses a blockchain-based command-and-control (C2) infrastructure to make it resilient to takedown efforts.\n\"Instead of relying on traditional servers or domains for command-and-control, Aeternum stores its instructions on the public Polygon blockchain,\" Qrator Labs said in a report shared with The"
  },
  {
    "title": "UAT-10027 Targets U.S. Education and Healthcare with Dohdoor Backdoor",
    "link": "https://thehackernews.com/2026/02/uat-10027-targets-us-education-and.html",
    "published": "Thu, 26 Feb 2026 20:47:00 +0530",
    "summary": "A previously undocumented threat activity cluster has been attributed to an ongoing malicious campaign targeting education and healthcare sectors in the U.S. since at least December 2025.\nThe campaign is being tracked by Cisco Talos under the moniker UAT-10027. The end goal of the attacks is to deliver a never-before-seen backdoor codenamed Dohdoor.\n\"Dohdoor utilizes the DNS-over-HTTPS (DoH)"
  },
  {
    "title": "ThreatsDay Bulletin: Kali Linux + Claude, Chrome Crash Traps, WinRAR Flaws, LockBit & 15+ Stories",
    "link": "https://thehackernews.com/2026/02/threatsday-bulletin-kali-linux-claude.html",
    "published": "Thu, 26 Feb 2026 19:58:00 +0530",
    "summary": "Nothing here looks dramatic at first glance. That’s the point. Many of this week’s threats begin with something ordinary, like an ad, a meeting invite, or a software update.\nBehind the scenes, the tactics are sharper. Access happens faster. Control is established sooner. Cleanup becomes harder.\nHere is a quick look at the signals worth paying attention to.\n\n\n\n\n\n  \n \n\n  \n  \n    AI-powered command"
  },
  {
    "title": "Expert Recommends: Prepare for PQC Right Now",
    "link": "https://thehackernews.com/2026/02/expert-recommends-prepare-for-pqc-right.html",
    "published": "Thu, 26 Feb 2026 17:36:00 +0530",
    "summary": "Introduction: Steal It Today, Break It in a Decade\nDigital evolution is unstoppable, and though the pace may vary, things tend to fall into place sooner rather than later. That, of course, applies to adversaries as well. The rise of ransomware and cyber extortion generated funding for a complex and highly professional criminal ecosystem. The era of the cloud brought general availability of"
  }
]