[
  {
    "title": "BeyondTrust Flaw Used for Web Shells, Backdoors, and Data Exfiltration",
    "link": "https://thehackernews.com/2026/02/beyondtrust-flaw-used-for-web-shells.html",
    "published": "Fri, 20 Feb 2026 21:15:00 +0530",
    "summary": "Threat actors have been observed exploiting a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products to conduct a wide range of malicious actions, including deploying VShell and&nbsp;\nThe vulnerability, tracked as CVE-2026-1731 (CVSS score: 9.9), allows attackers to execute operating system commands in the context of the"
  },
  {
    "title": "Cline CLI 2.3.0 Supply Chain Attack Installed OpenClaw on Developer Systems",
    "link": "https://thehackernews.com/2026/02/cline-cli-230-supply-chain-attack.html",
    "published": "Fri, 20 Feb 2026 19:50:00 +0530",
    "summary": "In yet another software supply chain attack, the open-source, artificial intelligence (AI)-powered coding assistant Cline CLI was updated to stealthily install OpenClaw, a self-hosted autonomous AI agent that has become exceedingly popular in the past few months.\n\"On February 17, 2026, at 3:26 AM PT, an unauthorized party used a compromised npm publish token to publish an update to Cline CLI"
  },
  {
    "title": "ClickFix Campaign Abuses Compromised Sites to Deploy MIMICRAT Malware",
    "link": "https://thehackernews.com/2026/02/clickfix-campaign-abuses-compromised.html",
    "published": "Fri, 20 Feb 2026 17:25:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new ClickFix campaign that abuses compromised legitimate sites to deliver a previously undocumented remote access trojan (RAT) called MIMICRAT (aka AstarionRAT).\n\"The campaign demonstrates a high level of operational sophistication: compromised sites spanning multiple industries and geographies serve as delivery infrastructure, a multi-stage"
  },
  {
    "title": "Identity Cyber Scores: The New Metric Shaping Cyber Insurance in 2026",
    "link": "https://thehackernews.com/2026/02/identity-cyber-scores-new-metric.html",
    "published": "Fri, 20 Feb 2026 16:00:00 +0530",
    "summary": "With one in three cyber-attacks now involving compromised employee accounts, insurers and regulators are placing far greater emphasis on identity posture when assessing cyber risk.&nbsp;\nFor many organizations, however, these assessments remain largely opaque. Elements such as password hygiene, privileged access management, and the extent of multi-factor authentication (MFA) coverage are"
  },
  {
    "title": "Ukrainian National Sentenced to 5 Years in North Korea IT Worker Fraud Case",
    "link": "https://thehackernews.com/2026/02/ukrainian-national-sentenced-to-5-years.html",
    "published": "Fri, 20 Feb 2026 15:22:00 +0530",
    "summary": "A 29-year-old Ukrainian national has been sentenced to five years in prison in the U.S. for his role in facilitating North Korea's fraudulent information technology (IT) worker scheme.\nIn November 2025, Oleksandr \"Alexander\" Didenko pleaded guilty to wire fraud conspiracy and aggravated identity theft for stealing the identities of U.S. citizens and selling them to IT workers to help them land"
  },
  {
    "title": "FBI Reports 1,900 ATM Jackpotting Incidents Since 2020, $20M Lost in 2025",
    "link": "https://thehackernews.com/2026/02/fbi-reports-1900-atm-jackpotting.html",
    "published": "Fri, 20 Feb 2026 13:35:00 +0530",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) has warned of an increase in ATM jackpotting incidents across the country, leading to losses of more than $20 million in 2025.\nThe agency said 1,900 ATM jackpotting incidents have been reported since 2020, out of which 700 took place last year. In December 2025, the U.S. Department of Justice (DoJ) said about $40.73 million has been collectively"
  },
  {
    "title": "Former Google Engineers Indicted Over Trade Secret Transfers to Iran",
    "link": "https://thehackernews.com/2026/02/three-former-google-engineers-indicted.html",
    "published": "Fri, 20 Feb 2026 10:57:00 +0530",
    "summary": "Two former Google engineers and one of their husbands have been indicted in the U.S. for allegedly committing trade secret theft from the search giant and other tech firms and transferring the information to unauthorized locations, including Iran.\nSamaneh Ghandali, 41, and her husband Mohammadjavad Khosravi (aka Mohammad Khosravi), 40, along with her sister Soroor Ghandali, 32, have been accused"
  },
  {
    "title": "PromptSpy Android Malware Abuses Gemini AI to Automate Recent-Apps Persistence",
    "link": "https://thehackernews.com/2026/02/promptspy-android-malware-abuses-google.html",
    "published": "Thu, 19 Feb 2026 23:22:00 +0530",
    "summary": "Cybersecurity researchers have discovered what they say is the first Android malware that abuses Gemini, Google's generative artificial intelligence (AI) chatbot, as part of its execution flow and achieves persistence.\nThe malware has been codenamed PromptSpy by ESET. The malware is equipped to capture lockscreen data, block uninstallation efforts, gather device information, take screenshots,"
  },
  {
    "title": "INTERPOL Operation Red Card 2.0 Arrests 651 in African Cybercrime Crackdown",
    "link": "https://thehackernews.com/2026/02/interpol-operation-red-card-20-arrests.html",
    "published": "Thu, 19 Feb 2026 23:20:00 +0530",
    "summary": "An international cybercrime operation against online scams has led to 651 arrests and recovered more than $4.3 million as part of an effort led by law enforcement agencies from 16 African countries.\nThe initiative, codenamed Operation Red Card 2.0, took place between December 8, 2025 and January 30, 2026, according to INTERPOL. It targeted infrastructure and actors behind high-yield investment"
  },
  {
    "title": "Microsoft Patches CVE-2026-26119 Privilege Escalation in Windows Admin Center",
    "link": "https://thehackernews.com/2026/02/microsoft-patches-cve-2026-26119.html",
    "published": "Thu, 19 Feb 2026 23:10:00 +0530",
    "summary": "Microsoft has disclosed a now-patched security flaw in Windows Admin Center that could allow an attacker to escalate their privileges.\nWindows Admin Center is a locally deployed, browser-based management tool set that lets users manage their Windows Clients, Servers, and Clusters without the need for connecting to the cloud.\nThe high-severity vulnerability, tracked as CVE-2026-26119, carries a"
  }
]