[
  {
    "title": "RoguePilot Flaw in GitHub Codespaces Enabled Copilot to Leak GITHUB_TOKEN",
    "link": "https://thehackernews.com/2026/02/roguepilot-flaw-in-github-codespaces.html",
    "published": "Wed, 25 Feb 2026 00:22:00 +0530",
    "summary": "A vulnerability in GitHub Codespaces could have been exploited by bad actors to seize control of repositories by injecting malicious Copilot instructions in a GitHub issue.\nThe artificial intelligence (AI)-driven vulnerability has been codenamed RoguePilot by Orca Security. It has since been patched by Microsoft following responsible disclosure.\n\"Attackers can craft hidden instructions inside a"
  },
  {
    "title": "UAC-0050 Targets European Financial Institution With Spoofed Domain and RMS Malware",
    "link": "https://thehackernews.com/2026/02/uac-0050-targets-european-financial.html",
    "published": "Tue, 24 Feb 2026 19:51:00 +0530",
    "summary": "A Russia-aligned threat actor has been observed targeting a European financial institution as part of a social engineering attack to likely facilitate intelligence gathering or financial theft, signaling a possible expansion of the threat actor's targeting beyond Ukraine and into entities supporting the war-torn nation.\nThe activity, which targeted an unnamed entity involved in regional"
  },
  {
    "title": "Identity Prioritization isn't a Backlog Problem - It's a Risk Math Problem",
    "link": "https://thehackernews.com/2026/02/identity-prioritization-isnt-backlog.html",
    "published": "Tue, 24 Feb 2026 17:28:00 +0530",
    "summary": "Most identity programs still prioritize work the way they prioritize IT tickets: by volume, loudness, or “what failed a control check.” That approach breaks the moment your environment stops being mostly-human and mostly-onboarded.\nIn modern enterprises, identity risk is created by a compound of factors: control posture, hygiene, business context, and intent. Any one of these can perhaps be"
  },
  {
    "title": "Lazarus Group Uses Medusa Ransomware in Middle East and U.S. Healthcare Attacks",
    "link": "https://thehackernews.com/2026/02/lazarus-group-uses-medusa-ransomware-in.html",
    "published": "Tue, 24 Feb 2026 17:22:00 +0530",
    "summary": "The North Korea-linked Lazarus Group (aka Diamond Sleet and Pompilus) has been observed using Medusa ransomware in an attack targeting an unnamed entity in the Middle East, according to a new report by the Symantec and Carbon Black Threat Hunter Team.\nBroadcom's threat intelligence division said it also identified the same threat actors mounting an unsuccessful attack against a healthcare"
  },
  {
    "title": "UnsolicitedBooker Targets Central Asian Telecoms With LuciDoor and MarsSnake Backdoors",
    "link": "https://thehackernews.com/2026/02/unsolicitedbooker-targets-central-asian.html",
    "published": "Tue, 24 Feb 2026 15:24:00 +0530",
    "summary": "The threat activity cluster known as UnsolicitedBooker has been observed targeting telecommunications companies in Kyrgyzstan and Tajikistan, marking a shift from prior attacks aimed at Saudi Arabian entities.\nThe attacks involve the deployment of two distinct backdoors codenamed LuciDoor and MarsSnake, according to a report published by Positive Technologies last week.\n\"The group used several"
  },
  {
    "title": "Anthropic Says Chinese AI Firms Used 16 Million Claude Queries to Copy Model",
    "link": "https://thehackernews.com/2026/02/anthropic-says-chinese-ai-firms-used-16.html",
    "published": "Tue, 24 Feb 2026 11:34:00 +0530",
    "summary": "Anthropic on Monday said it identified \"industrial-scale campaigns\" mounted by three artificial intelligence (AI) companies, DeepSeek, Moonshot AI, and MiniMax, to illegally extract Claude's capabilities to improve their own models.\nThe distillation attacks generated over 16 million exchanges with its large language model (LLM) through about 24,000 fraudulent accounts in violation of its terms"
  },
  {
    "title": "APT28 Targeted European Entities Using Webhook-Based Macro Malware",
    "link": "https://thehackernews.com/2026/02/apt28-targeted-european-entities-using.html",
    "published": "Tue, 24 Feb 2026 01:11:00 +0530",
    "summary": "The Russia-linked state-sponsored threat actor tracked as APT28 has been attributed to a new campaign targeting specific entities in Western and Central Europe.\nThe activity, per S2 Grupo's LAB52 threat intelligence team, was active between September 2025 and January 2026. It has been codenamed Operation MacroMaze. \"The campaign relies on basic tooling and the exploitation of legitimate services"
  },
  {
    "title": "Wormable XMRig Campaign Uses BYOVD Exploit and Time-Based Logic Bomb",
    "link": "https://thehackernews.com/2026/02/wormable-xmrig-campaign-uses-byovd.html",
    "published": "Mon, 23 Feb 2026 23:29:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new cryptojacking campaign that uses pirated software bundles as lures to deploy a bespoke XMRig miner program on compromised hosts.\n\"Analysis of the recovered dropper, persistence triggers, and mining payload reveals a sophisticated, multi-stage infection prioritizing maximum cryptocurrency mining hashrate, often destabilizing the victim"
  },
  {
    "title": "⚡ Weekly Recap: Double-Tap Skimmers, PromptSpy AI, 30Tbps DDoS, Docker Malware & More",
    "link": "https://thehackernews.com/2026/02/weekly-recap-double-tap-skimmers.html",
    "published": "Mon, 23 Feb 2026 18:30:00 +0530",
    "summary": "Security news rarely moves in a straight line. This week, it feels more like a series of sharp turns, some happening quietly in the background, others playing out in public view. The details are different, but the pressure points are familiar.\nAcross devices, cloud services, research labs, and even everyday apps, the line between normal behavior and hidden risk keeps getting thinner. Tools"
  },
  {
    "title": "How Exposed Endpoints Increase Risk Across LLM Infrastructure",
    "link": "https://thehackernews.com/2026/02/how-exposed-endpoints-increase-risk.html",
    "published": "Mon, 23 Feb 2026 17:28:00 +0530",
    "summary": "As more organizations run their own Large Language Models (LLMs), they are also deploying more internal services and Application Programming Interfaces (APIs) to support those models. Modern security risks are being introduced less from the models themselves and more from the infrastructure that serves, connects and automates the model. Each new LLM endpoint expands the attack surface, often in"
  }
]