[
  {
    "title": "Citizen Lab Finds Cellebrite Tool Used on Kenyan Activist’s Phone in Police Custody",
    "link": "https://thehackernews.com/2026/02/citizen-lab-finds-cellebrite-tool-used.html",
    "published": "Wed, 18 Feb 2026 23:00:00 +0530",
    "summary": "New research from the Citizen Lab has found signs that Kenyan authorities used a commercial forensic extraction tool manufactured by Israeli company Cellebrite to break into a prominent dissident's phone, making it the latest case of abuse of the technology targeting civil society.\nThe interdisciplinary research unit at the University of Toronto's Munk School of Global Affairs &amp; Public"
  },
  {
    "title": "Grandstream GXP1600 VoIP Phones Exposed to Unauthenticated Remote Code Execution",
    "link": "https://thehackernews.com/2026/02/grandstream-gxp1600-voip-phones-exposed.html",
    "published": "Wed, 18 Feb 2026 22:05:00 +0530",
    "summary": "Cybersecurity researchers have disclosed a critical security flaw in the Grandstream GXP1600 series of VoIP phones that could allow an attacker to seize control of susceptible devices.\nThe vulnerability, tracked as CVE-2026-2329, carries a CVSS score of 9.3 out of a maximum of 10.0. It has been described as a case of unauthenticated stack-based buffer overflow that could result in remote code"
  },
  {
    "title": "Critical Flaws Found in Four VS Code Extensions with Over 125 Million Installs",
    "link": "https://thehackernews.com/2026/02/critical-flaws-found-in-four-vs-code.html",
    "published": "Wed, 18 Feb 2026 18:46:00 +0530",
    "summary": "Cybersecurity researchers have disclosed multiple security vulnerabilities in four popular Microsoft Visual Studio Code (VS Code) extensions that, if successfully exploited, could allow threat actors to steal local files and execute code remotely.\nThe extensions, which have been collectively installed more than 125 million times, are Live Server, Code Runner, Markdown Preview Enhanced, and"
  },
  {
    "title": "Cybersecurity Tech Predictions for 2026: Operating in a World of Permanent Instability",
    "link": "https://thehackernews.com/2026/02/cybersecurity-tech-predictions-for-2026.html",
    "published": "Wed, 18 Feb 2026 17:28:00 +0530",
    "summary": "In 2025, navigating the digital seas still felt like a matter of direction. Organizations charted routes, watched the horizon, and adjusted course to reach safe harbors of resilience, trust, and compliance.\nIn 2026, the seas are no longer calm between storms. Cybersecurity now unfolds in a state of&nbsp;continuous atmospheric instability: AI-driven threats that adapt in real time, expanding"
  },
  {
    "title": "Dell RecoverPoint for VMs Zero-Day CVE-2026-22769 Exploited Since Mid-2024",
    "link": "https://thehackernews.com/2026/02/dell-recoverpoint-for-vms-zero-day-cve.html",
    "published": "Wed, 18 Feb 2026 16:02:00 +0530",
    "summary": "A maximum severity security vulnerability in Dell RecoverPoint for Virtual Machines has been exploited as a zero-day by a suspected China-nexus threat cluster dubbed UNC6201 since mid-2024, according to a new report from Google Mandiant and Google Threat Intelligence Group (GTIG).\nThe activity involves the exploitation of CVE-2026-22769 (CVSS score: 10.0), a case of hard-coded credentials"
  },
  {
    "title": "3 Ways to Start Your Intelligent Workflow Program",
    "link": "https://thehackernews.com/2026/02/3-ways-to-start-your-intelligent.html",
    "published": "Wed, 18 Feb 2026 16:00:00 +0530",
    "summary": "Security, IT, and engineering teams today are under relentless pressure to accelerate outcomes, cut operational drag, and unlock the full potential of AI and automation. But simply investing in tools isn’t enough. 88% of AI proofs-of-concept never make it to production, even though 70% of workers cite freeing time for high-value work as the primary AI automation motivation. Real impact comes"
  },
  {
    "title": "Notepad++ Fixes Hijacked Update Mechanism Used to Deliver Targeted Malware",
    "link": "https://thehackernews.com/2026/02/notepad-fixes-hijacked-update-mechanism.html",
    "published": "Wed, 18 Feb 2026 13:10:00 +0530",
    "summary": "Notepad++ has released a security fix to plug gaps that were exploited by an advanced threat actor from China to hijack the software update mechanism to selectively deliver malware to targets of interest.\nThe version 8.9.2 update incorporates what maintainer Don Ho calls a \"double lock\" design that aims to make the update process \"robust and effectively unexploitable.\" This includes verification"
  },
  {
    "title": "CISA Flags Four Security Flaws Under Active Exploitation in Latest KEV Update",
    "link": "https://thehackernews.com/2026/02/cisa-flags-four-security-flaws-under.html",
    "published": "Wed, 18 Feb 2026 12:22:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe list of vulnerabilities is as follows -\n\nCVE-2026-2441 (CVSS score: 8.8) - A use-after-free vulnerability in Google Chrome that could allow a remote attacker to potentially exploit heap"
  },
  {
    "title": "Webinar: How Modern SOC Teams Use AI and Context to Investigate Cloud Breaches Faster",
    "link": "https://thehackernews.com/2026/02/cloud-forensics-webinar-learn-how-ai.html",
    "published": "Wed, 18 Feb 2026 00:38:00 +0530",
    "summary": "Cloud attacks move fast — faster than most incident response teams.\nIn data centers, investigations had time. Teams could collect disk images, review logs, and build timelines over days. In the cloud, infrastructure is short-lived. A compromised instance can disappear in minutes. Identities rotate. Logs expire. Evidence can vanish before analysis even begins.\nCloud forensics is fundamentally"
  },
  {
    "title": "Researchers Show Copilot and Grok Can Be Abused as Malware C2 Proxies",
    "link": "https://thehackernews.com/2026/02/researchers-show-copilot-and-grok-can.html",
    "published": "Tue, 17 Feb 2026 23:38:00 +0530",
    "summary": "Cybersecurity researchers have disclosed that artificial intelligence (AI) assistants that support web browsing or URL fetching capabilities can be turned into stealthy command-and-control (C2) relays, a technique that could allow attackers to blend into legitimate enterprise communications and evade detection.\nThe attack method, which has been demonstrated against Microsoft Copilot and xAI Grok"
  }
]