[
  {
    "title": "Trust Wallet Chrome Extension Breach Caused $7 Million Crypto Loss via Malicious Code",
    "link": "https://thehackernews.com/2025/12/trust-wallet-chrome-extension-bug.html",
    "published": "Fri, 26 Dec 2025 21:01:00 +0530",
    "summary": "Trust Wallet is urging users to update its Google Chrome extension to the latest version following what it described as a \"security incident\" that led to the loss of approximately $7 million.\nThe issue, the multi‑chain, non‑custodial cryptocurrency wallet service said, impacts version 2.68. The extension has about one million users, according to the Chrome Web Store listing. Users are advised to"
  },
  {
    "title": "China-Linked Evasive Panda Ran DNS Poisoning Campaign to Deliver MgBot Malware",
    "link": "https://thehackernews.com/2025/12/china-linked-evasive-panda-ran-dns.html",
    "published": "Fri, 26 Dec 2025 20:14:00 +0530",
    "summary": "A China-linked advanced persistent threat (APT) group has been attributed to a highly-targeted cyber espionage campaign in which the adversary poisoned Domain Name System (DNS) requests to deliver its signature MgBot backdoor in attacks targeting victims in Türkiye, China, and India.\nThe activity, Kaspersky said, was observed between November 2022 and November 2024. It has been linked to a"
  },
  {
    "title": "Critical LangChain Core Vulnerability Exposes Secrets via Serialization Injection",
    "link": "https://thehackernews.com/2025/12/critical-langchain-core-vulnerability.html",
    "published": "Fri, 26 Dec 2025 14:57:00 +0530",
    "summary": "A critical security flaw has been disclosed in LangChain Core that could be exploited by an attacker to steal sensitive secrets and even influence large language model (LLM) responses through prompt injection.\nLangChain Core (i.e., langchain-core) is a core Python package that's part of the LangChain ecosystem, providing the core interfaces and model-agnostic abstractions for building"
  },
  {
    "title": "ThreatsDay Bulletin: Stealth Loaders, AI Chatbot Flaws AI Exploits, Docker Hack, and 15 More Stories",
    "link": "https://thehackernews.com/2025/12/threatsday-bulletin-stealth-loaders-ai.html",
    "published": "Thu, 25 Dec 2025 19:31:00 +0530",
    "summary": "It’s getting harder to tell where normal tech ends and malicious intent begins. Attackers are no longer just breaking in — they’re blending in, hijacking everyday tools, trusted apps, and even AI assistants. What used to feel like clear-cut “hacker stories” now looks more like a mirror of the systems we all use.\nThis week’s findings show a pattern: precision, patience, and persuasion. The"
  },
  {
    "title": "LastPass 2022 Breach Led to Years-Long Cryptocurrency Thefts, TRM Labs Finds",
    "link": "https://thehackernews.com/2025/12/lastpass-2022-breach-led-to-years-long.html",
    "published": "Thu, 25 Dec 2025 18:16:00 +0530",
    "summary": "The encrypted vault backups stolen from the 2022 LastPass data breach have enabled bad actors to take advantage of weak master passwords to crack them open and drain cryptocurrency assets as recently as late 2025, according to new findings from TRM Labs.\nThe blockchain intelligence firm said evidence points to the involvement of Russian cybercriminal actors in the activity, with one of the"
  },
  {
    "title": "Fortinet Warns of Active Exploitation of FortiOS SSL VPN 2FA Bypass Vulnerability",
    "link": "https://thehackernews.com/2025/12/fortinet-warns-of-active-exploitation.html",
    "published": "Thu, 25 Dec 2025 13:52:00 +0530",
    "summary": "Fortinet on Wednesday said it observed \"recent abuse\" of a five-year-old security flaw in FortiOS SSL VPN in the wild under certain configurations.\nThe vulnerability in question is CVE-2020-12812 (CVSS score: 5.2), an improper authentication vulnerability in SSL VPN in FortiOS that could allow a user to log in successfully without being prompted for the second factor of authentication if the"
  },
  {
    "title": "CISA Flags Actively Exploited Digiever NVR Vulnerability Allowing Remote Code Execution",
    "link": "https://thehackernews.com/2025/12/cisa-flags-actively-exploited-digiever.html",
    "published": "Thu, 25 Dec 2025 13:37:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a security flaw impacting Digiever DS-2105 Pro network video recorders (NVRs) to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation.\nThe vulnerability, tracked as CVE-2023-52163 (CVSS score: 8.8), relates to a case of command injection that allows post-authentication remote code"
  },
  {
    "title": "New MacSync macOS Stealer Uses Signed App to Bypass Apple Gatekeeper",
    "link": "https://thehackernews.com/2025/12/new-macsync-macos-stealer-uses-signed.html",
    "published": "Wed, 24 Dec 2025 21:53:00 +0530",
    "summary": "Cybersecurity researchers have discovered a new variant of a macOS information stealer called MacSync that's delivered by means of a digitally signed, notarized Swift application masquerading as a messaging app installer to bypass Apple's Gatekeeper checks.\n\"Unlike earlier MacSync Stealer variants that primarily rely on drag-to-terminal or ClickFix-style techniques, this sample adopts a more"
  },
  {
    "title": "Nomani Investment Scam Surges 62% Using AI Deepfake Ads on Social Media",
    "link": "https://thehackernews.com/2025/12/nomani-investment-scam-surges-62-using.html",
    "published": "Wed, 24 Dec 2025 18:38:00 +0530",
    "summary": "The fraudulent investment scheme known as Nomani has witnessed an increase by 62%, according to data from ESET, as campaigns distributing the threat have also expanded beyond Facebook to include other social media platforms, such as YouTube.\nThe Slovak cybersecurity company said it blocked over 64,000 unique URLs associated with the threat this year. A majority of the detections originated from"
  },
  {
    "title": "Attacks are Evolving: 3 Ways to Protect Your Business in 2026",
    "link": "https://thehackernews.com/2025/12/attacks-are-evolving-3-ways-to-protect.html",
    "published": "Wed, 24 Dec 2025 17:00:00 +0530",
    "summary": "Every year, cybercriminals find new ways to steal money and data from businesses. Breaching a business network, extracting sensitive data, and selling it on the dark web has become a reliable payday.&nbsp;\nBut in 2025, the data breaches that affected small and medium-sized businesses (SMBs) challenged our perceived wisdom about exactly which types of businesses cybercriminals are targeting.&nbsp"
  }
]