[
  {
    "title": "Android Droppers Now Deliver SMS Stealers and Spyware, Not Just Banking Trojans",
    "link": "https://thehackernews.com/2025/09/android-droppers-now-deliver-sms.html",
    "published": "Mon, 01 Sep 2025 22:58:00 +0530",
    "summary": "Cybersecurity researchers are calling attention to a new shift in the Android malware landscape where dropper apps, which are typically used to deliver banking trojans, to also distribute simpler malware such as SMS stealers and basic spyware.\nThese campaigns are propagated via dropper apps masquerading as government or banking apps in India and other parts of Asia, ThreatFabric said in a report"
  },
  {
    "title": "⚡ Weekly Recap: WhatsApp 0-Day, Docker Bug, Salesforce Breach, Fake CAPTCHAs, Spyware App & More",
    "link": "https://thehackernews.com/2025/09/weekly-recap-whatsapp-0-day-docker-bug.html",
    "published": "Mon, 01 Sep 2025 18:32:00 +0530",
    "summary": "Cybersecurity today is less about single attacks and more about chains of small weaknesses that connect into big risks. One overlooked update, one misused account, or one hidden tool in the wrong hands can be enough to open the door.\nThe news this week shows how attackers are mixing methods—combining stolen access, unpatched software, and clever tricks to move from small entry points to large"
  },
  {
    "title": "When Browsers Become the Attack Surface: Rethinking Security for Scattered Spider",
    "link": "https://thehackernews.com/2025/09/when-browsers-become-attack-surface.html",
    "published": "Mon, 01 Sep 2025 17:25:00 +0530",
    "summary": "As enterprises continue to shift their operations to the browser, security teams face a growing set of cyber challenges. In fact, over 80% of security incidents now originate from web applications accessed via Chrome, Edge, Firefox, and other browsers. One particularly fast-evolving adversary, Scattered Spider, has made it their mission to wreak havoc on enterprises by specifically targeting"
  },
  {
    "title": "ScarCruft Uses RokRAT Malware in Operation HanKook Phantom Targeting South Korean Academics",
    "link": "https://thehackernews.com/2025/09/scarcruft-uses-rokrat-malware-in.html",
    "published": "Mon, 01 Sep 2025 13:56:00 +0530",
    "summary": "Cybersecurity researchers have discovered a new phishing campaign undertaken by the North Korea-linked hacking group called ScarCruft (aka APT37) to deliver a malware known as RokRAT.\nThe activity has been codenamed Operation HanKook Phantom by Seqrite Labs, stating the attacks appear to target individuals associated with the National Intelligence Research Association, including academic figures"
  },
  {
    "title": "Attackers Abuse Velociraptor Forensic Tool to Deploy Visual Studio Code for C2 Tunneling",
    "link": "https://thehackernews.com/2025/08/attackers-abuse-velociraptor-forensic.html",
    "published": "Sat, 30 Aug 2025 17:36:00 +0530",
    "summary": "Cybersecurity researchers have called attention to a cyber attack in which unknown threat actors deployed an open-source endpoint monitoring and digital forensic tool called Velociraptor, illustrating ongoing abuse of legitimate software for malicious purposes.\n\"In this incident, the threat actor used the tool to download and execute Visual Studio Code with the likely intention of creating a"
  },
  {
    "title": "WhatsApp Patches Zero-Click Exploit Targeting iOS and macOS Devices",
    "link": "https://thehackernews.com/2025/08/whatsapp-issues-emergency-update-for.html",
    "published": "Sat, 30 Aug 2025 10:06:00 +0530",
    "summary": "WhatsApp has addressed a security vulnerability in its messaging apps for Apple iOS and macOS that it said may have been exploited in the wild in conjunction with a recently disclosed Apple flaw in targeted zero-day attacks.\nThe vulnerability, CVE-2025-55177 (CVSS score: 8.0 [CISA-ADP]/5.4 [Facebook]), relates to a case of insufficient authorization of linked device synchronization messages."
  },
  {
    "title": "Researchers Warn of Sitecore Exploit Chain Linking Cache Poisoning and Remote Code Execution",
    "link": "https://thehackernews.com/2025/08/researchers-warn-of-sitecore-exploit.html",
    "published": "Fri, 29 Aug 2025 22:52:00 +0530",
    "summary": "Three new security vulnerabilities have been disclosed in the Sitecore Experience Platform that could be exploited to achieve information disclosure and remote code execution.&nbsp;\nThe flaws, per watchTowr Labs, are listed below -\n\nCVE-2025-53693 - HTML cache poisoning through unsafe reflections\nCVE-2025-53691 - Remote code execution (RCE) through insecure deserialization\nCVE-2025-53694 -"
  },
  {
    "title": "Webinar: Learn How to Unite Dev, Sec, and Ops Teams With One Shared Playbook",
    "link": "https://thehackernews.com/2025/08/webinar-why-top-teams-are-prioritizing.html",
    "published": "Fri, 29 Aug 2025 21:12:00 +0530",
    "summary": "Picture this: Your team rolls out some new code, thinking everything's fine. But hidden in there is a tiny flaw that explodes into a huge problem once it hits the cloud. Next thing you know, hackers are in, and your company is dealing with a mess that costs millions.\nScary, right? In 2025, the average data breach hits businesses with a whopping $4.44 million bill globally. And guess what? A big"
  },
  {
    "title": "Amazon Disrupts APT29 Watering Hole Campaign Abusing Microsoft Device Code Authentication",
    "link": "https://thehackernews.com/2025/08/amazon-disrupts-apt29-watering-hole.html",
    "published": "Fri, 29 Aug 2025 18:52:00 +0530",
    "summary": "Amazon on Friday said it flagged and disrupted what it described as an opportunistic watering hole campaign orchestrated by the Russia-linked APT29 actors as part of their intelligence gathering efforts.\nThe campaign used \"compromised websites to redirect visitors to malicious infrastructure designed to trick users into authorizing attacker-controlled devices through Microsoft's device code"
  },
  {
    "title": "Abandoned Sogou Zhuyin Update Server Hijacked, Weaponized in Taiwan Espionage Campaign",
    "link": "https://thehackernews.com/2025/08/abandoned-sogou-zhuyin-update-server.html",
    "published": "Fri, 29 Aug 2025 18:42:00 +0530",
    "summary": "An abandoned update server associated with input method editor (IME) software Sogou Zhuyin was leveraged by threat actors as part of an espionage campaign to deliver several malware families, including C6DOOR and GTELAM, in attacks primarily targeting users across Eastern Asia.\n\"Attackers employed sophisticated infection chains, such as hijacked software updates and fake cloud storage or login"
  }
]