[
  {
    "title": "Mustang Panda Deploys SnakeDisk USB Worm to Deliver Yokai Backdoor on Thailand IPs",
    "link": "https://thehackernews.com/2025/09/mustang-panda-deploys-snakedisk-usb.html",
    "published": "Tue, 16 Sep 2025 00:15:00 +0530",
    "summary": "The China-aligned threat actor known as Mustang Panda has been observed using an updated version of a backdoor called TONESHELL and a previously undocumented USB worm called SnakeDisk.\n\"The worm only executes on devices with Thailand-based IP addresses and drops the Yokai backdoor,\" IBM X-Force researchers Golo Mühr and Joshua Chung said in an analysis published last week.\nThe tech giant's"
  },
  {
    "title": "6 Browser-Based Attacks Security Teams Need to Prepare For Right Now",
    "link": "https://thehackernews.com/2025/09/6-browser-based-attacks-security-teams.html",
    "published": "Mon, 15 Sep 2025 17:25:00 +0530",
    "summary": "Attacks that target users in their web browsers have seen an unprecedented rise in recent years. In this article, we’ll explore what a “browser-based attack” is, and why they’re proving to be so effective.&nbsp;\nWhat is a browser-based attack?\nFirst, it’s important to establish what a browser-based attack is.\nIn most scenarios, attackers don’t think of themselves as attacking your web browser."
  },
  {
    "title": "⚡ Weekly Recap: Bootkit Malware, AI-Powered Attacks, Supply Chain Breaches, Zero-Days & More",
    "link": "https://thehackernews.com/2025/09/weekly-recap-bootkit-malware-ai-powered.html",
    "published": "Mon, 15 Sep 2025 16:52:00 +0530",
    "summary": "In a world where threats are persistent, the modern CISO’s real job isn't just to secure technology—it's to preserve institutional trust and ensure business continuity.\nThis week, we saw a clear pattern: adversaries are targeting the complex relationships that hold businesses together, from supply chains to strategic partnerships. With new regulations and the rise of AI-driven attacks, the"
  },
  {
    "title": "AI-Powered Villager Pen Testing Tool Hits 11,000 PyPI Downloads Amid Abuse Concerns",
    "link": "https://thehackernews.com/2025/09/ai-powered-villager-pen-testing-tool.html",
    "published": "Mon, 15 Sep 2025 12:42:00 +0530",
    "summary": "A new artificial intelligence (AI)-powered penetration testing tool linked to a China-based company has attracted nearly 11,000 downloads on the Python Package Index (PyPI) repository, raising concerns that it could be repurposed by cybercriminals for malicious purposes.\nDubbed Villager, the framework is assessed to be the work of Cyberspike, which has positioned the tools as a red teaming"
  },
  {
    "title": "HiddenGh0st, Winos and kkRAT Exploit SEO, GitHub Pages in Chinese Malware Attacks",
    "link": "https://thehackernews.com/2025/09/hiddengh0st-winos-and-kkrat-exploit-seo.html",
    "published": "Mon, 15 Sep 2025 11:17:00 +0530",
    "summary": "Chinese-speaking users are the target of a search engine optimization (SEO) poisoning campaign that uses fake software sites to distribute malware.\n\"The attackers manipulated search rankings with SEO plugins and registered lookalike domains that closely mimicked legitimate software sites,\" Fortinet FortiGuard Labs researcher Pei Han Liao said. \"By using convincing language and small character"
  },
  {
    "title": "FBI Warns of UNC6040 and UNC6395 Targeting Salesforce Platforms in Data Theft Attacks",
    "link": "https://thehackernews.com/2025/09/fbi-warns-of-unc6040-and-unc6395.html",
    "published": "Sat, 13 Sep 2025 14:34:00 +0530",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) has issued a flash alert to release indicators of compromise (IoCs) associated with two cybercriminal groups tracked as UNC6040 and UNC6395 for orchestrating a string of data theft and extortion attacks.\n\n\"Both groups have recently been observed targeting organizations' Salesforce platforms via different initial access mechanisms,\" the FBI said."
  },
  {
    "title": "Samsung Fixes Critical Zero-Day CVE-2025-21043 Exploited in Android Attacks",
    "link": "https://thehackernews.com/2025/09/samsung-fixes-critical-zero-day-cve.html",
    "published": "Fri, 12 Sep 2025 20:46:00 +0530",
    "summary": "Samsung has released its monthly security updates for Android, including a fix for a security vulnerability that it said has been exploited in zero-day attacks.\nThe vulnerability, CVE-2025-21043 (CVSS score: 8.8), concerns an out-of-bounds write that could result in arbitrary code execution.\n\"Out-of-bounds Write in libimagecodec.quram.so prior to SMR Sep-2025 Release 1 allows remote attackers to"
  },
  {
    "title": "Apple Warns French Users of Fourth Spyware Campaign in 2025, CERT-FR Confirms",
    "link": "https://thehackernews.com/2025/09/apple-warns-french-users-of-fourth.html",
    "published": "Fri, 12 Sep 2025 20:19:00 +0530",
    "summary": "Apple has notified users in France of a spyware campaign targeting their devices, according to the Computer Emergency Response Team of France (CERT-FR).\nThe agency said the alerts were sent out on September 3, 2025, making it the fourth time this year that Apple has notified citizens in the county that at least one of the devices linked to their iCloud accounts may have been compromised as part"
  },
  {
    "title": "New HybridPetya Ransomware Bypasses UEFI Secure Boot With CVE-2024-7344 Exploit",
    "link": "https://thehackernews.com/2025/09/new-hybridpetya-ransomware-bypasses.html",
    "published": "Fri, 12 Sep 2025 17:20:00 +0530",
    "summary": "Cybersecurity researchers have discovered a new ransomware strain dubbed HybridPetya that resembles the notorious Petya/NotPetya malware, while also incorporating the ability to bypass the Secure Boot mechanism in Unified Extensible Firmware Interface (UEFI) systems using a now-patched vulnerability disclosed earlier this year.\nSlovakian cybersecurity company ESET said the samples were uploaded"
  },
  {
    "title": "Critical CVE-2025-5086 in DELMIA Apriso Actively Exploited, CISA Issues Warning",
    "link": "https://thehackernews.com/2025/09/critical-cve-2025-5086-in-delmia-apriso.html",
    "published": "Fri, 12 Sep 2025 16:33:00 +0530",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a critical security flaw impacting Dassault Systèmes DELMIA Apriso Manufacturing Operations Management (MOM) software to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerability, tracked as CVE-2025-5086, carries a CVSS score of 9.0 out of 10.0. According to"
  }
]