[
  {
    "title": "China-Linked PlugX and Bookworm Malware Attacks Target Asian Telecom and ASEAN Networks",
    "link": "https://thehackernews.com/2025/09/china-linked-plugx-and-bookworm-malware.html",
    "published": "Sat, 27 Sep 2025 17:36:00 +0530",
    "summary": "Telecommunications and manufacturing sectors in Central and South Asian countries have emerged as the target of an ongoing campaign distributing a new variant of a known malware called PlugX (aka Korplug or SOGU).\n\"The new variant's features overlap with both the RainyDay and Turian backdoors, including abuse of the same legitimate applications for DLL side-loading, the"
  },
  {
    "title": "Researchers Expose Phishing Threats Distributing CountLoader and PureRAT",
    "link": "https://thehackernews.com/2025/09/researchers-expose-svg-and-purerat.html",
    "published": "Fri, 26 Sep 2025 22:10:00 +0530",
    "summary": "A new campaign has been observed impersonating Ukrainian government agencies in phishing attacks to deliver CountLoader, which is then used to drop Amatera Stealer and PureMiner.\n\"The phishing emails contain malicious Scalable Vector Graphics (SVG) files designed to trick recipients into opening harmful attachments,\" Fortinet FortiGuard Labs researcher Yurren Wan said in a report shared with The"
  },
  {
    "title": "New COLDRIVER Malware Campaign Joins BO Team and Bearlyfy in Russia-Focused Cyberattacks",
    "link": "https://thehackernews.com/2025/09/new-coldriver-malware-campaign-joins-bo.html",
    "published": "Fri, 26 Sep 2025 18:15:00 +0530",
    "summary": "The Russian advanced persistent threat (APT) group known as COLDRIVER has been attributed to a fresh round of ClickFix-style attacks designed to deliver two new \"lightweight\" malware families tracked as BAITSWITCH and SIMPLEFIX.\nZscaler ThreatLabz, which detected the new multi-stage ClickFix campaign earlier this month, described BAITSWITCH as a downloader that ultimately drops SIMPLEFIX, a"
  },
  {
    "title": "Crash Tests for Security: Why BAS Is Proof of Defense, Not Assumptions",
    "link": "https://thehackernews.com/2025/09/crash-tests-for-security-why-bas-is.html",
    "published": "Fri, 26 Sep 2025 16:52:00 +0530",
    "summary": "Car makers don’t trust blueprints. They smash prototypes into walls. Again and again. In controlled conditions.\nBecause design specs don’t prove survival. Crash tests do. They separate theory from reality. Cybersecurity is no different. Dashboards overflow with “critical” exposure alerts. Compliance reports tick every box.&nbsp;\nBut none of that proves what matters most to a CISO:\n\nThe"
  },
  {
    "title": "Fortra GoAnywhere CVSS 10 Flaw Exploited as 0-Day a Week Before Public Disclosure",
    "link": "https://thehackernews.com/2025/09/fortra-goanywhere-cvss-10-flaw.html",
    "published": "Fri, 26 Sep 2025 14:52:00 +0530",
    "summary": "Cybersecurity company watchTowr Labs has disclosed that it has \"credible evidence\" of active exploitation of the recently disclosed security flaw in Fortra GoAnywhere Managed File Transfer (MFT) software as early as September 10, 2025, a whole week before it was publicly disclosed.\n\"This is not 'just' a CVSS 10.0 flaw in a solution long favored by APT groups and ransomware operators – it is a"
  },
  {
    "title": "New macOS XCSSET Variant Targets Firefox with Clipper and Persistence Module",
    "link": "https://thehackernews.com/2025/09/new-macos-xcsset-variant-targets.html",
    "published": "Fri, 26 Sep 2025 14:39:00 +0530",
    "summary": "Cybersecurity researchers have discovered an updated version of a known Apple macOS malware called XCSSET that has been observed in limited attacks.\n\"This new variant of XCSSET brings key changes related to browser targeting, clipboard hijacking, and persistence mechanisms,\" the Microsoft Threat Intelligence team said in a Thursday report.\n\"It employs sophisticated encryption and obfuscation"
  },
  {
    "title": "Cisco ASA Firewall Zero-Day Exploits Deploy RayInitiator and LINE VIPER Malware",
    "link": "https://thehackernews.com/2025/09/cisco-asa-firewall-zero-day-exploits.html",
    "published": "Fri, 26 Sep 2025 11:21:00 +0530",
    "summary": "The U.K. National Cyber Security Centre (NCSC) has revealed that threat actors have exploited the recently disclosed security flaws impacting Cisco firewalls as part of zero-day attacks to deliver previously undocumented malware families like RayInitiator and LINE VIPER.\n\"The RayInitiator and LINE VIPER malware represent a significant evolution on that used in the previous campaign, both in"
  },
  {
    "title": "Urgent: Cisco ASA Zero-Day Duo Under Attack; CISA Triggers Emergency Mitigation Directive",
    "link": "https://thehackernews.com/2025/09/urgent-cisco-asa-zero-day-duo-under.html",
    "published": "Thu, 25 Sep 2025 23:47:00 +0530",
    "summary": "Cisco is urging customers to patch two security flaws impacting the VPN web server of Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) Software, which it said have been exploited in the wild.\nThe zero-day vulnerabilities in question are listed below -\n\nCVE-2025-20333 (CVSS score: 9.9) - An improper validation of user-supplied input"
  },
  {
    "title": "Threatsday Bulletin: Rootkit Patch, Federal Breach, OnePlus SMS Leak, TikTok Scandal & More",
    "link": "https://thehackernews.com/2025/09/threatsday-bulletin-rootkit-patch.html",
    "published": "Thu, 25 Sep 2025 22:54:00 +0530",
    "summary": "Welcome to this week’s Threatsday Bulletin—your Thursday check-in on the latest twists and turns in cybersecurity and hacking.\nThe digital threat landscape never stands still. One week it’s a critical zero-day, the next it’s a wave of phishing lures or a state-backed disinformation push. Each headline is a reminder that the rules keep changing and that defenders—whether you’re protecting a"
  },
  {
    "title": "Vane Viper Generates 1 Trillion DNS Queries to Power Global Malware and Ad Fraud Network",
    "link": "https://thehackernews.com/2025/09/vane-viper-generates-1-trillion-dns.html",
    "published": "Thu, 25 Sep 2025 22:52:00 +0530",
    "summary": "The threat actor known as Vane Viper has been outed as a purveyor of malicious ad technology (adtech), while relying on a tangled web of shell companies and opaque ownership structures to deliberately evade responsibility.\n\"Vane Viper has provided core infrastructure in widespread malvertising, ad fraud, and cyberthreat proliferation for at least a decade,\" Infoblox said in a technical report"
  }
]