[
  {
    "title": "DPRK Hackers Use ClickFix to Deliver BeaverTail Malware in Crypto Job Scams",
    "link": "https://thehackernews.com/2025/09/dprk-hackers-use-clickfix-to-deliver.html",
    "published": "Sun, 21 Sep 2025 16:26:00 +0530",
    "summary": "Threat actors with ties to the Democratic People's Republic of Korea (aka DPRK or North Korea) have been observed leveraging ClickFix-style lures to deliver a known malware called BeaverTail and InvisibleFerret.\n\"The threat actor used ClickFix lures to target marketing and trader roles in cryptocurrency and retail sector organizations rather than targeting software development roles,\" GitLab"
  },
  {
    "title": "LastPass Warns of Fake Repositories Infecting macOS with Atomic Infostealer",
    "link": "https://thehackernews.com/2025/09/lastpass-warns-of-fake-repositories.html",
    "published": "Sat, 20 Sep 2025 12:37:00 +0530",
    "summary": "LastPass is warning of an ongoing, widespread information stealer campaign targeting Apple macOS users through fake GitHub repositories that distribute malware-laced programs masquerading as legitimate tools.\n\n\"In the case of LastPass, the fraudulent repositories redirected potential victims to a repository that downloads the Atomic infostealer malware,\" researchers Alex Cox, Mike Kosak, and"
  },
  {
    "title": "Researchers Uncover GPT-4-Powered MalTerminal Malware Creating Ransomware, Reverse Shell",
    "link": "https://thehackernews.com/2025/09/researchers-uncover-gpt-4-powered.html",
    "published": "Sat, 20 Sep 2025 11:18:00 +0530",
    "summary": "Cybersecurity researchers have discovered what they say is the earliest example known to date of a malware that bakes in Large Language Model (LLM) capabilities.\nThe malware has been codenamed MalTerminal by SentinelOne SentinelLABS research team. The findings were presented at the LABScon 2025 security conference.\nIn a report examining the malicious use of LLMs, the cybersecurity company said"
  },
  {
    "title": "ShadowLeak Zero-Click Flaw Leaks Gmail Data via OpenAI ChatGPT Deep Research Agent",
    "link": "https://thehackernews.com/2025/09/shadowleak-zero-click-flaw-leaks-gmail.html",
    "published": "Sat, 20 Sep 2025 11:01:00 +0530",
    "summary": "Cybersecurity researchers have disclosed a zero-click flaw in OpenAI ChatGPT's Deep Research agent that could allow an attacker to leak sensitive Gmail inbox data with a single crafted email without any user action.\nThe new class of attack has been codenamed ShadowLeak by Radware. Following responsible disclosure on June 18, 2025, the issue was addressed by OpenAI in early August.\n\"The attack"
  },
  {
    "title": "UNC1549 Hacks 34 Devices in 11 Telecom Firms via LinkedIn Job Lures and MINIBIKE Malware",
    "link": "https://thehackernews.com/2025/09/unc1549-hacks-34-devices-in-11-telecom.html",
    "published": "Fri, 19 Sep 2025 21:36:00 +0530",
    "summary": "An Iran-nexus cyber espionage group known as UNC1549 has been attributed to a new campaign targeting European telecommunications companies, successfully infiltrating 34 devices across 11 organizations as part of a recruitment-themed activity on LinkedIn.\nSwiss cybersecurity company PRODAFT is tracking the cluster under the name Subtle Snail. It's assessed to be affiliated with Iran's Islamic"
  },
  {
    "title": "SystemBC Powers REM Proxy With 1,500 Daily VPS Victims Across 80 C2 Servers",
    "link": "https://thehackernews.com/2025/09/systembc-powers-rem-proxy-with-1500.html",
    "published": "Fri, 19 Sep 2025 19:56:00 +0530",
    "summary": "A proxy network known as REM Proxy is powered by malware known as SystemBC, offering about 80% of the botnet to its users, according to new findings from the Black Lotus Labs team at Lumen Technologies.\n\"REM Proxy is a sizeable network, which also markets a pool of 20,000 Mikrotik routers and a variety of open proxies it finds freely available online,\" the company said in a report shared with"
  },
  {
    "title": "Fortra Releases Critical Patch for CVSS 10.0 GoAnywhere MFT Vulnerability",
    "link": "https://thehackernews.com/2025/09/fortra-releases-critical-patch-for-cvss.html",
    "published": "Fri, 19 Sep 2025 19:42:00 +0530",
    "summary": "Fortra has disclosed details of a critical security flaw in GoAnywhere Managed File Transfer (MFT) software that could result in the execution of arbitrary commands.\nThe vulnerability, tracked as CVE-2025-10035, carries a CVSS score of 10.0, indicating maximum severity.\n\"A deserialization vulnerability in the License Servlet of Fortra's GoAnywhere MFT allows an actor with a validly forged"
  },
  {
    "title": "17,500 Phishing Domains Target 316 Brands Across 74 Countries in Global PhaaS Surge",
    "link": "https://thehackernews.com/2025/09/17500-phishing-domains-target-316.html",
    "published": "Fri, 19 Sep 2025 19:32:00 +0530",
    "summary": "The phishing-as-a-service (PhaaS) offerings known as Lighthouse and Lucid has been linked to more than 17,500 phishing domains targeting 316 brands from 74 countries.\n\"Phishing-as-a-Service (PhaaS) deployments have risen significantly recently,\" Netcraft said in a new report. \"The PhaaS operators charge a monthly fee for phishing software with pre-installed templates impersonating, in some cases"
  },
  {
    "title": "How To Automate Alert Triage With AI Agents and Confluence SOPs Using Tines",
    "link": "https://thehackernews.com/2025/09/how-to-automate-alert-triage-with-ai.html",
    "published": "Fri, 19 Sep 2025 16:30:00 +0530",
    "summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features over 1,000 pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform's Community Edition.\nThe workflow we are highlighting streamlines security alert handling by automatically identifying and executing the appropriate Standard"
  },
  {
    "title": "Russian Hackers Gamaredon and Turla Collaborate to Deploy Kazuar Backdoor in Ukraine",
    "link": "https://thehackernews.com/2025/09/russian-hackers-gamaredon-and-turla.html",
    "published": "Fri, 19 Sep 2025 13:54:00 +0530",
    "summary": "Cybersecurity researchers have discerned evidence of two Russian hacking groups Gamaredon and Turla collaborating together to target and co-comprise Ukrainian entities.\nSlovak cybersecurity company ESET said it observed the Gamaredon tools PteroGraphin and PteroOdd being used to execute Turla group's Kazuar backdoor on an endpoint in Ukraine in February 2025, indicating that Turla is very likely"
  }
]