[
  {
    "title": "AI Tools Fuel Brazilian Phishing Scam While Efimer Trojan Steals Crypto from 5,000 Victims",
    "link": "https://thehackernews.com/2025/08/ai-tools-fuel-brazilian-phishing-scam.html",
    "published": "Fri, 08 Aug 2025 21:44:00 +0530",
    "summary": "Cybersecurity researchers are drawing attention to a new campaign that's using legitimate generative artificial intelligence (AI)-powered website building tools like DeepSite AI and BlackBox AI to create replica phishing pages mimicking Brazilian government agencies as part of a financially motivated campaign.\nThe activity involves the creation of lookalike sites imitating Brazil's State"
  },
  {
    "title": "Leaked Credentials Up 160%: What Attackers Are Doing With Them",
    "link": "https://thehackernews.com/2025/08/leaked-credentials-up-160-what.html",
    "published": "Fri, 08 Aug 2025 16:30:00 +0530",
    "summary": "When an organization’s credentials are leaked, the immediate consequences are rarely visible—but the long-term impact is far-reaching. Far from the cloak-and-dagger tactics seen in fiction, many real-world cyber breaches begin with something deceptively simple: a username and password.\nAccording to Verizon’s 2025 Data Breach Investigations Report, leaked credentials accounted for 22% of breaches"
  },
  {
    "title": "RubyGems, PyPI Hit by Malicious Packages Stealing Credentials, Crypto, Forcing Security Changes",
    "link": "https://thehackernews.com/2025/08/rubygems-pypi-hit-by-malicious-packages.html",
    "published": "Fri, 08 Aug 2025 16:28:00 +0530",
    "summary": "A fresh set of 60 malicious packages has been uncovered targeting the RubyGems ecosystem by posing as seemingly innocuous automation tools for social media, blogging, or messaging services to steal credentials from unsuspecting users.\nThe activity is assessed to be active since at least March 2023, according to the software supply chain security company Socket. Cumulatively, the gems have been"
  },
  {
    "title": "GreedyBear Steals $1M in Crypto Using 150+ Malicious Firefox Wallet Extensions",
    "link": "https://thehackernews.com/2025/08/greedybear-steals-1m-in-crypto-using.html",
    "published": "Fri, 08 Aug 2025 12:46:00 +0530",
    "summary": "A newly discovered campaign dubbed GreedyBear has leveraged over 150 malicious extensions to the Firefox marketplace that are designed to impersonate popular cryptocurrency wallets and steal more than $1 million in digital assets.\nThe published browser add-ons masquerade as MetaMask, TronLink, Exodus, and Rabby Wallet, among others, Koi Security researcher Tuval Admoni said.\nWhat makes the"
  },
  {
    "title": "SocGholish Malware Spread via Ad Tools; Delivers Access to LockBit, Evil Corp, and Others",
    "link": "https://thehackernews.com/2025/08/socgholish-malware-spread-via-ad-tools.html",
    "published": "Thu, 07 Aug 2025 23:56:00 +0530",
    "summary": "The threat actors behind the SocGholish malware have been observed leveraging Traffic Distribution Systems (TDSs) like Parrot TDS and Keitaro TDS to filter and redirect unsuspecting users to sketchy content.\n\"The core of their operation is a sophisticated Malware-as-a-Service (MaaS) model, where infected systems are sold as initial access points to other cybercriminal organizations,\" Silent Push"
  },
  {
    "title": "Webinar: How to Stop Python Supply Chain Attacks—and the Expert Tools You Need",
    "link": "https://thehackernews.com/2025/08/webinar-how-to-stop-python-supply-chain.html",
    "published": "Thu, 07 Aug 2025 21:03:00 +0530",
    "summary": "Python is everywhere in modern software. From machine learning models to production microservices, chances are your code—and your business—depends on Python packages you didn’t write.\nBut in 2025, that trust comes with a serious risk.\nEvery few weeks, we’re seeing fresh headlines about malicious packages uploaded to the Python Package Index (PyPI)—many going undetected until after they’ve caused"
  },
  {
    "title": "Malicious Go, npm Packages Deliver Cross-Platform Malware, Trigger Remote Data Wipes",
    "link": "https://thehackernews.com/2025/08/malicious-go-npm-packages-deliver-cross.html",
    "published": "Thu, 07 Aug 2025 18:49:00 +0530",
    "summary": "Cybersecurity researchers have discovered a set of 11 malicious Go packages that are designed to download additional payloads from remote servers and execute them on both Windows and Linux systems.\n\"At runtime the code silently spawns a shell, pulls a second-stage payload from an interchangeable set of .icu and .tech command-and-control (C2) endpoints, and executes it in memory,\" Socket security"
  },
  {
    "title": "The AI-Powered Security Shift: What 2025 Is Teaching Us About Cloud Defense",
    "link": "https://thehackernews.com/2025/08/the-ai-powered-security-shift-what-2025.html",
    "published": "Thu, 07 Aug 2025 16:15:00 +0530",
    "summary": "Now that we are well into 2025, cloud attacks are evolving faster than ever and artificial intelligence (AI) is both a weapon and a shield. As AI rapidly changes how enterprises innovate, security teams are now tasked with a triple burden:\n\nSecure AI embedded in every part of the business.\nUse AI to defend faster and smarter.\nFight AI-powered threats that execute in minutes—or seconds.\n\nSecurity"
  },
  {
    "title": "Microsoft Discloses Exchange Server Flaw Enabling Silent Cloud Access in Hybrid Setups",
    "link": "https://thehackernews.com/2025/08/microsoft-discloses-exchange-server.html",
    "published": "Thu, 07 Aug 2025 16:12:00 +0530",
    "summary": "Microsoft has released an advisory for a high-severity security flaw affecting on-premise versions of Exchange Server that could allow an attacker to gain elevated privileges under certain conditions.\nThe vulnerability, tracked as CVE-2025-53786, carries a CVSS score of 8.0. Dirk-jan Mollema with Outsider Security has been acknowledged for reporting the bug.\n\"In an Exchange hybrid deployment, an"
  },
  {
    "title": "6,500 Axis Servers Expose Remoting Protocol; 4,000 in U.S. Vulnerable to Exploits",
    "link": "https://thehackernews.com/2025/08/6500-axis-servers-expose-remoting.html",
    "published": "Thu, 07 Aug 2025 16:10:00 +0530",
    "summary": "Cybersecurity researchers have disclosed multiple security flaws in video surveillance products from Axis Communications that, if successfully exploited, could expose them to takeover attacks.\n\"The attack results in pre-authentication remote code execution on Axis Device Manager, a server used to configure and manage fleets of cameras, and the Axis Camera Station, client software used to view"
  }
]