[
  {
    "title": "Secret Blizzard Deploys Malware in ISP-Level AitM Attacks on Moscow Embassies",
    "link": "https://thehackernews.com/2025/07/secret-blizzard-deploys-malware-in-isp.html",
    "published": "Thu, 31 Jul 2025 22:42:00 +0530",
    "summary": "The Russian nation-state threat actor known as Secret Blizzard has been observed orchestrating a new cyber espionage campaign targeting foreign embassies located in Moscow by means of an adversary-in-the-middle (AitM) attack at the Internet Service Provider (ISP) level and delivering a custom malware dubbed ApolloShadow.\n\"ApolloShadow has the capability to install a trusted root certificate to"
  },
  {
    "title": "Experts Detect Multi-Layer Redirect Tactic Used to Steal Microsoft 365 Login Credentials",
    "link": "https://thehackernews.com/2025/07/experts-detect-multi-layer-redirect.html",
    "published": "Thu, 31 Jul 2025 21:19:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a new phishing campaign that conceals malicious payloads by abusing link wrapping services from Proofpoint and Intermedia to bypass defenses.\n\"Link wrapping is designed by vendors like Proofpoint to protect users by routing all clicked URLs through a scanning service, allowing them to block known malicious destinations at the moment of click,\""
  },
  {
    "title": "N. Korean Hackers Used Job Lures, Cloud Account Access, and Malware to Steal Millions in Crypto",
    "link": "https://thehackernews.com/2025/07/n-korean-hackers-used-job-lures-cloud.html",
    "published": "Thu, 31 Jul 2025 19:17:00 +0530",
    "summary": "The North Korea-linked threat actor known as UNC4899 has been attributed to attacks targeting two different organizations by approaching their employees via LinkedIn and Telegram.\n\"Under the guise of freelance opportunities for software development work, UNC4899 leveraged social engineering techniques to successfully convince the targeted employees to execute malicious Docker containers in their"
  },
  {
    "title": "AI-Driven Trends in Endpoint Security: What the 2025 Gartner® Magic Quadrant™ Reveals",
    "link": "https://thehackernews.com/2025/07/ai-driven-trends-in-endpoint-security.html",
    "published": "Thu, 31 Jul 2025 16:55:00 +0530",
    "summary": "Cyber threats and attacks like ransomware continue to increase in volume and complexity with the endpoint typically being the most sought after and valued target. With the rapid expansion and adoption of AI, it is more critical than ever to ensure the endpoint is adequately secured by a platform capable of not just keeping pace, but staying ahead of an ever-evolving threat landscape."
  },
  {
    "title": "UNC2891 Breaches ATM Network via 4G Raspberry Pi, Tries CAKETAP Rootkit for Fraud",
    "link": "https://thehackernews.com/2025/07/unc2891-breaches-atm-network-via-4g.html",
    "published": "Thu, 31 Jul 2025 15:47:00 +0530",
    "summary": "The financially motivated threat actor known as UNC2891 has been observed targeting Automatic Teller Machine (ATM) infrastructure using a 4G-equipped Raspberry Pi as part of a covert attack.\nThe cyber-physical attack involved the adversary leveraging their physical access to install the Raspberry Pi device and have it connected directly to the same network switch as the ATM, effectively placing"
  },
  {
    "title": "Alert Fatigue, Data Overload, and the Fall of Traditional SIEMs",
    "link": "https://thehackernews.com/2025/07/alert-fatigue-data-overload-and-fall-of.html",
    "published": "Thu, 31 Jul 2025 15:30:00 +0530",
    "summary": "Security Operations Centers (SOCs) are stretched to their limits. Log volumes are surging, threat landscapes are growing more complex, and security teams are chronically understaffed. Analysts face a daily battle with alert noise, fragmented tools, and incomplete data visibility. At the same time, more vendors are phasing out their on-premises SIEM solutions, encouraging migration to SaaS"
  },
  {
    "title": "Hackers Exploit Critical WordPress Theme Flaw to Hijack Sites via Remote Plugin Install",
    "link": "https://thehackernews.com/2025/07/hackers-exploit-critical-wordpress.html",
    "published": "Thu, 31 Jul 2025 12:23:00 +0530",
    "summary": "Threat actors are actively exploiting a critical security flaw in \"Alone – Charity Multipurpose Non-profit WordPress Theme\" to take over susceptible sites.\nThe vulnerability, tracked as CVE-2025-5394, carries a CVSS score of 9.8. Security researcher Thái An has been credited with discovering and reporting the bug.\nAccording to Wordfence, the shortcoming relates to an arbitrary file upload"
  },
  {
    "title": "Hackers Use Facebook Ads to Spread JSCEAL Malware via Fake Cryptocurrency Trading Apps",
    "link": "https://thehackernews.com/2025/07/hackers-use-facebook-ads-to-spread.html",
    "published": "Wed, 30 Jul 2025 21:51:00 +0530",
    "summary": "Cybersecurity researchers are calling attention to an ongoing campaign that distributes fake cryptocurrency trading apps to deploy a compiled V8 JavaScript (JSC) malware called JSCEAL that can capture data such as credentials and wallets.\nThe activity leverages thousands of malicious advertisements posted on Facebook in an attempt to redirect unsuspecting victims to counterfeit sites that"
  },
  {
    "title": "FunkSec Ransomware Decryptor Released Free to Public After Group Goes Dormant",
    "link": "https://thehackernews.com/2025/07/funksec-ransomware-decryptor-released.html",
    "published": "Wed, 30 Jul 2025 21:41:00 +0530",
    "summary": "Cybersecurity experts have released a decryptor for a ransomware strain called FunkSec, allowing victims to recover access to their files for free.\n\"Because the ransomware is now considered dead, we released the decryptor for public download,\" Gen Digital researcher Ladislav Zezula said.\nFunkSec, which emerged towards the end of 2024, has claimed 172 victims, according to data from"
  },
  {
    "title": "Product Walkthrough: A Look Inside Pillar's AI Security Platform",
    "link": "https://thehackernews.com/2025/07/product-walkthrough-look-inside-pillars.html",
    "published": "Wed, 30 Jul 2025 18:33:00 +0530",
    "summary": "In this article, we will provide a brief overview of Pillar Security's platform to better understand how they are tackling AI security challenges. \nPillar Security is building a platform to cover the entire software development and deployment lifecycle with the goal of providing trust in AI systems. Using its holistic approach, the platform introduces new ways of detecting AI threats, beginning"
  }
]