[
  {
    "title": "UNC6384 Deploys PlugX via Captive Portal Hijacks and Valid Certificates Targeting Diplomats",
    "link": "https://thehackernews.com/2025/08/unc6384-deploys-plugx-via-captive.html",
    "published": "Mon, 25 Aug 2025 23:41:00 +0530",
    "summary": "A China-nexus threat actor known as UNC6384 has been attributed to a set of attacks targeting diplomats in Southeast Asia and other entities across the globe to advance Beijing's strategic interests.\n\"This multi-stage attack chain leverages advanced social engineering including valid code signing certificates, an adversary-in-the-middle (AitM) attack, and indirect execution techniques to evade"
  },
  {
    "title": "Docker Fixes CVE-2025-9074, Critical Container Escape Vulnerability With CVSS Score 9.3",
    "link": "https://thehackernews.com/2025/08/docker-fixes-cve-2025-9074-critical.html",
    "published": "Mon, 25 Aug 2025 23:23:00 +0530",
    "summary": "Docker has released fixes to address a critical security flaw affecting the Docker Desktop app for Windows and macOS that could potentially allow an attacker to break out of the confines of a container.\nThe vulnerability, tracked as CVE-2025-9074, carries a CVSS score of 9.3 out of 10.0. It has been addressed in version 4.44.3.\n\"A malicious container running on Docker Desktop could access the"
  },
  {
    "title": "Phishing Campaign Uses UpCrypter in Fake Voicemail Emails to Deliver RAT Payloads",
    "link": "https://thehackernews.com/2025/08/phishing-campaign-uses-upcrypter-in.html",
    "published": "Mon, 25 Aug 2025 21:34:00 +0530",
    "summary": "Cybersecurity researchers have flagged a new phishing campaign that's using fake voicemails and purchase orders to deliver a malware loader called UpCrypter.\nThe campaign leverages \"carefully crafted emails to deliver malicious URLs linked to convincing phishing pages,\" Fortinet FortiGuard Labs researcher Cara Lin said. \"These pages are designed to entice recipients into downloading JavaScript"
  },
  {
    "title": "⚡ Weekly Recap: Password Manager Flaws, Apple 0-Day, Hidden AI Prompts, In-the-Wild Exploits & More",
    "link": "https://thehackernews.com/2025/08/weekly-recap-password-manager-flaws.html",
    "published": "Mon, 25 Aug 2025 17:47:00 +0530",
    "summary": "Cybersecurity today moves at the pace of global politics. A single breach can ripple across supply chains, turn a software flaw into leverage, or shift who holds the upper hand. For leaders, this means defense isn’t just a matter of firewalls and patches—it’s about strategy. The strongest organizations aren’t the ones with the most tools, but the ones that see how cyber risks connect to business"
  },
  {
    "title": "Why SIEM Rules Fail and How to Fix Them: Insights from 160 Million Attack Simulations",
    "link": "https://thehackernews.com/2025/08/why-siem-rules-fail-and-how-to-fix-them.html",
    "published": "Mon, 25 Aug 2025 17:20:00 +0530",
    "summary": "Security Information and Event Management (SIEM) systems act as the primary tools for detecting suspicious activity in enterprise networks, helping organizations identify and respond to potential attacks in real time. However, the new Picus Blue Report 2025, based on over 160 million real-world attack simulations, revealed that organizations are only detecting 1 out of 7 simulated attacks,"
  },
  {
    "title": "Transparent Tribe Targets Indian Govt With Weaponized Desktop Shortcuts via Phishing",
    "link": "https://thehackernews.com/2025/08/transparent-tribe-targets-indian-govt.html",
    "published": "Mon, 25 Aug 2025 13:43:00 +0530",
    "summary": "The advanced persistent threat (APT) actor known as Transparent Tribe has been observed targeting both Windows and BOSS (Bharat Operating System Solutions) Linux systems with malicious Desktop shortcut files in attacks targeting Indian Government entities.\n\"Initial access is achieved through spear-phishing emails,\" CYFIRMA said. \"Linux BOSS environments are targeted via weaponized .desktop"
  },
  {
    "title": "Malicious Go Module Poses as SSH Brute-Force Tool, Steals Credentials via Telegram Bot",
    "link": "https://thehackernews.com/2025/08/malicious-go-module-poses-as-ssh-brute.html",
    "published": "Sun, 24 Aug 2025 19:08:00 +0530",
    "summary": "Cybersecurity researchers have discovered a malicious Go module that presents itself as a brute-force tool for SSH but actually contains functionality to discreetly exfiltrate credentials to its creator.\n\"On the first successful login, the package sends the target IP address, username, and password to a hard-coded Telegram bot controlled by the threat actor,\" Socket researcher Kirill Boychenko"
  },
  {
    "title": "GeoServer Exploits, PolarEdge, and Gayfemboy Push Cybercrime Beyond Traditional Botnets",
    "link": "https://thehackernews.com/2025/08/geoserver-exploits-polaredge-and.html",
    "published": "Sat, 23 Aug 2025 13:08:00 +0530",
    "summary": "Cybersecurity researchers are calling attention to multiple campaigns that are taking advantage of known security vulnerabilities and exposed Redis servers to various malicious activities, including leveraging the compromised devices as IoT botnets, residential proxies, or cryptocurrency mining infrastructure.\nThe first set of attacks entails the exploitation of CVE-2024-36401 (CVSS score: 9.8),"
  },
  {
    "title": "Linux Malware Delivered via Malicious RAR Filenames Evades Antivirus Detection",
    "link": "https://thehackernews.com/2025/08/linux-malware-delivered-via-malicious.html",
    "published": "Fri, 22 Aug 2025 20:01:00 +0530",
    "summary": "Cybersecurity researchers have shed light on a novel attack chain that employs phishing emails to deliver an open-source backdoor called VShell.\nThe \"Linux-specific malware infection chain that starts with a spam email with a malicious RAR archive file,\" Trellix researcher Sagar Bade said in a technical write-up.\n\"The payload isn't hidden inside the file content or a macro, it's encoded directly"
  },
  {
    "title": "Chinese Hackers Murky, Genesis, and Glacial Panda Escalate Cloud and Telecom Espionage",
    "link": "https://thehackernews.com/2025/08/chinese-hackers-murky-genesis-and.html",
    "published": "Fri, 22 Aug 2025 16:36:00 +0530",
    "summary": "Cybersecurity researchers are calling attention to malicious activity orchestrated by a China-nexus cyber espionage group known as Murky Panda that involves abusing trusted relationships in the cloud to breach enterprise networks.\n\"The adversary has also shown considerable ability to quickly weaponize N-day and zero-day vulnerabilities and frequently achieves initial access to their targets by"
  }
]